{
  "architectures": [
    "BirdMindModel"
  ],
  "block_size": 24,
  "device": "cuda",
  "embedding_dim": 512,
  "eos_token_id": 151645,
  "max_seq_len": 4096,
  "model_type": "birdmind",
  "moe_inter_dim": 512,
  "n_activated_experts": 2,
  "n_expert_groups": 6,
  "n_shared_experts": 2,
  "num_heads": 8,
  "pad_token_id": 151643,
  "qk_dim": 128,
  "router_aux_loss_coef": 0.001,
  "score_func": "softmax",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "unk_token_id": null,
  "use_flash_attention": false,
  "use_moe": true,
  "use_sliding_window": false,
  "v_dim": 128,
  "vocab_size": 151936
}
