#version: 0.2
ï ¼
ä ¸
ç ļ
çļ Ħ
ï¼ Į
ã Ģ
ãĢ Ĥ
n t
Ġ '
ä »
ä º
å ı
æ ľ
' :
ä ½
è ¿
å ħ
æ Ī
å Ĵ
å Ī
ç Ķ
åĴ Į
Ġ Ġ
å ®
å Ĭ
å ľ
å ¤
l e
e r
c o
å Ĳ
è ¯
Ġ t
æ ĸ
æ ĺ
r o
ãĢ ģ
* *
ç »
ä¸ Ģ
e nt
ä» ¥
æ ķ
ï¼ ļ
ĥ ½
ãĢĤ \
è ®
åı ¯
co nt
Ġ a
' ,
é Ģ
ä ¹
s t
å º
æĺ ¯
cont ent
ro le
{ '
è ĥ½
åľ ¨
å Ń
i n
' }
çĶ ¨
ä¸ ª
h e
å Į
å °
ä ¼
æ Ĺ
è ¡
å ¸
è §
é ĩ
æ Ŀ
å ¯
æ Ģ
a s
ä¸ Ń
å ĩ
Ġ {'
ç Ń
æľ ī
r e
å Ľ
ä ¿
'} ,
s i
äº º
è¿ Ļ
åı¯ ä»¥
¦ Ĥ
å ¼
ç İ
u s
o n
a t
å Ĩ
æĪ ĳ
è ¦
å ¦Ĥ
Ġ **
Ġt he
å ¹
å ·
è¦ ģ
æķ °
æ ŀ
ç ī
é ¢
çļĦ æ
é Ĺ
ç §
ä¸ º
st a
o r
** ï¼ļ
è Ģ
æ Ĭ
ç Ĳ
äº Ĩ
ä ¾
æ ³
æ ı
ç Ľ
ä¸ į
å ½
us er
æ ī
å ¾
as si
sta nt
assi stant
æ ł
çŃ ī
ä» ¬
çĶ Ł
è¡ Į
æĹ ¶
æ į
æ İ
é Ŀ
äº İ
æı Ĳ
å ¥
n d
æĿ ¥
å į
\ \
æ Ń
è ĩ
Ġ s
çĲ Ĩ
å¯ ¹
Ġ i
æĸ ¹
å ĵ
æĢ §
æ Ľ
æĪ ĸ
ĠĠ ĠĠ
åŃ ¦
é ľ
äº Ľ
éĢ ļ
ä¸Ģ ä¸ª
Ġ p
Ġ f
æ Ķ
æ ĭ
ä½ ł
è¿ ĩ
ä¿ Ŀ
è ´
æĪ Ĳ
æ Ħ
éľ Ģ
åĮ ĸ
æ Į
a l
ä½ ¿
Ġ o
ä½ ľ
æ Ļ
æĽ ´
æĸ ĩ
åĪ Ĩ
ä¼ ļ
ç ®
ä¸ ĭ
ãĢĤ '},
æį ®
åĪ °
e s
æ µ
å ¿
å ĳ
in g
åº Ķ
åĬ ¨
æ ĥ
Ġ w
å· ¥
åľ °
å® ļ
å ±
a n
åı ĳ
ç ¨
ç ¡
è ¾
ĠĠ Ġ
è¿ Ľ
a r
é Ļ
Ġ c
æ³ ķ
è§ £
èĩ ª
ä½¿ çĶ¨
Ġ m
å Ł
æ Ĥ
Ġ d
ä½ ĵ
i t
â Ģ
æ °
è µ
` `
åĲ Į
[ {'
o u
Ġ b
Ġ =
éľĢ è¦ģ
åħ ³
å İ
å¥ ½
Ġt o
ä¸ İ
çİ °
å¤ ļ
æ ¯
æŀ ľ
ç¡ ®
é «
ä¸ Ĭ
åı¯ èĥ½
éĿ ¢
i on
Ġo f
å¤ §
é« ĺ
åĬ ł
åĬ Ľ
åĩ º
åº ¦
ç ¤
e d
é¢ ĺ
ç¨ ĭ
'} ]
éĹ ®
æĬ Ģ
# #
i c
æ ´
çī ©
é ģ
Ġ in
æĤ ¨
åĲ Ī
ç ±
é £
éĩ ı
å® ŀ
ç ³
å¸ ¸
ç§ į
ç «
ç º
æķ° æį®
å ¢
æ ±
ï¼ Ł
æĪĳ ä»¬
å ģ
ä» ĸ
Ġ e
è ½
å »
å° Ĩ
Ġ n
åĬ ©
æľ ¯
è® ¡
åħ ¶
ç Ħ
å¹ ¶
éĹ ´
c t
æľ º
Ġa nd
éĩ į
ï¼ļ \
ä¾ Ľ
å» º
é ĺ
è ī
è¡ ¨
ç ½
ç ´
æ ¸
ç³ »
å¼ ı
è °
éĢļ è¿ĩ
ï¼ ī
Ġ \\
ï¼ Ī
ç± »
å Ģ
æĸ °
çĦ ¶
ä¸ ļ
e n
t h
ä¹ ł
æıĲ ä¾Ľ
æĻ º
ç Ĥ
ãĢĤ '}]
Ġ co
æľ Ģ
Ł ¥
è® ¾
Ġ re
åĪ ¶
è ¶
ä¾ ĭ
å® ĥ
åĵ ģ
æĮ ģ
åĮ ħ
çİ ¯
åŃ Ĳ
æ ²
çļĦ ç
æĻº èĥ½
è Ĥ
åħ ¥
å¸ ®
æ ģ
ä¿ ¡
éĹ® é¢ĺ
u m
r a
r i
çī ¹
ä» £
åĽ ł
åĬ ¡
èĢ Į
èĢ ħ
æľ ¬
é Ķ
æĦ Ł
åħ ¨
Ġi s
æ ¬
åħ ·
ä¹ Ł
Ġt h
å± ķ
ï¼Ł '},
ä¹ ĭ
Ġ -
ç ł
è¿Ľ è¡Į
e t
Ġ y
å ŀ
å½ ±
æĦ ı
Ġ 1
æķ Ī
ç® Ĺ
åĲ İ
æĥ ħ
å® ¶
å ī
æ´ »
ä¸Ģ äºĽ
é ļ
æĬĢ æľ¯
ä» ¶
Ġ "
i s
ç ĸ
åŃ¦ ä¹ł
é ¡
å¸® åĬ©
Ġ h
ç» Ł
l o
ç Ŀ
å¦Ĥ æŀľ
é ª
å° ı
è¯ Ń
å Ļ
ç» ı
ç ķ
çĤ ¹
è Ĭ
è¯ ·
åĻ ¨
çĽ ®
çĽ ¸
æĪ ·
å¼ Ģ
æ ·
éĢ ī
è¿Ļ äºĽ
m p
åŀ ĭ
ä»¥ ä¸ĭ
æ± Ĥ
äº §
`` `
å½ ĵ
åĪ Ľ
å¾ Ĺ
éĢ Ĥ
æģ ¯
åŃ Ĺ
ä» İ
é ¦
åı Ĭ
åħ ¬
åĨ ħ
: \
é Ľ
u t
ç» ĵ
å¿ ĥ
åı ĺ
v e
æ ¨
Ġy ou
âĢ ľ
ä¸ »
å¤ ©
æ º
âĢ Ŀ
è ·
é ķ
ç ¼
l i
å¤ Ħ
å¹ ³
æī Ģ
ç ľ
å® ī
äºº å·¥
ç ©
åĨ ³
d e
åĽ ½
c e
äº ¤
åºĶ çĶ¨
çĶ µ
èī ²
m e
åı ĸ
çĿ Ģ
ç ¬
åĵ į
ç¤ ¾
ä½ ķ
äººå·¥ æĻºèĥ½
æľ Ł
æ¨ ¡
é ħ
è ģ
ä¹ Ī
å Ŀ
é ĥ½
æł ĩ
å¢ ĥ
è Ļ
0 0
) \
æĭ ¬
. \
é ĥ
èµ Ħ
ç¡® ä¿Ŀ
åĮħ æĭ¬
u l
æº Ĳ
è° ĥ
è¿Ļ ä¸ª
Ġ `
ä½ Ĩ
ç ¾
u r
éķ ¿
Ġ T
è´ ¨
äº ĭ
ĠĠĠĠ ĠĠĠ
è¿ ĺ
ä¸į åĲĮ
c h
ä¿¡ æģ¯
Ġ 2
æĺ İ
éĥ ¨
Ġf or
æŃ ¤
å½± åĵį
ä¾ĭ å¦Ĥ
ç´ ł
ä» »
æİ ¥
å° ĳ
åľ º
æ° ´
æ¯ ı
ç³» ç»Ł
åĮ »
æĥ ³
éĢī æĭ
éĢīæĭ ©
at ion
é£ Ł
æľ į
ç¤ º
å¤ Ł
æĹ¶ éĹ´
çİ¯ å¢ĥ
é Ĥ
æŃ ¥
åĢ ¼
æıĲ é«ĺ
åıĳ å±ķ
åŁ º
è¯ Ĩ
å¥½ çļĦ
\ '
åĪ ©
å¤ ĸ
é£ İ
åŁ Ł
æ ¡
Ġ I
g e
æ¯ Ķ
at e
çİ ĩ
åĲ į
æķ ´
er s
åī į
i l
åŃ ĺ
è® ®
æ ¶
Ł ³
é¢ Ĩ
æ° Ķ
æĬ ¤
ç® ¡
æŃ £
å¯ ¼
åĪ Ĺ
åģ ¥
çŃ ĸ
éĩį è¦ģ
ã ģ
å¤Ħ çĲĨ
å¸ Ĥ
æ³ ¨
## #
çł ģ
æµ ĭ
q u
ç» Ļ
éĿ ŀ
åĩ ı
æŀ Ĳ
æĸ¹ æ³ķ
æķ Ļ
åı Ĺ
æĹ ¥
è¯ ķ
ç» Ħ
ç ĥ
æł ¹
Ġ g
åĩ Ĩ
ä½ į
å¢ ŀ
u n
åĪ «
ç§ ĳ
è ¢
è® ©
ä¼ ĺ
å¤ į
æ Ł
èĢ ĥ
ç½ ĳ
y th
çĸ Ĺ
è ¨
å¼ º
o t
åĨ Ļ
è į
å· ±
èĩª å·±
çĶ¨ æĪ·
å¹ ´
è®¡ ç®Ĺ
yth on
l y
åĪĨ æŀĲ
é¢ Ħ
åº ı
èĥ½ å¤Ł
æ Ł¥
åħ ĥ
æ »
o w
è¯ ¥
èĬ Ĥ
s e
ä¼ ł
æŀ Ħ
å® ¹
æµ ģ
æľ ª
ç Ł¥
éª Į
çĲ ĥ
Ġ or
å®ī åħ¨
åį ķ
æł ¼
å ĸ
ç¾ İ
éģ ĵ
è¿ Ĳ
æł¹ æį®
å¤ ĩ
ä¸Ń çļĦ
åĽ ŀ
æ· ±
ç« ł
é¢Ĩ åŁŁ
å¦Ĥ ä½ķ
è¿ °
åº ·
Ġp ro
è º
é Ł³
æĹ ł
Ġth at
è§ Ħ
è¢ «
æł ·
Ġ A
å½ ¢
å ķ
å §
Ġ S
æľį åĬ¡
èº «
Ġ (
åĨ µ
åģ¥ åº·
éĢļ å¸¸
æĢ ģ
æĸ¹ å¼ı
æĸĩ ç«ł
è Ĳ
p e
æ ®
è ±
ä»ĸ ä»¬
ç Ĺ
Ġb e
åĮ º
è§ Ĩ
è¾ ĵ
è¨ Ģ
åĲĮ æĹ¶
Ġ st
Ġc an
æĺ¯ ä¸Ģ
çº ¿
æĸ Ń
æĶ ¾
Ġ v
ç®¡ çĲĨ
Ġ +
è ĥ
éĤ £
åı Ĥ
it h
åĬ Ł
æĮ ĩ
Ġ 3
å»º è®®
æİ ¨
å·¥ ä½ľ
Ġa s
åĳ ĺ
é ¥
çĶŁ æ´»
é¡ ¹
åı į
Ġ C
å®ŀ çİ°
æĶ ¹
èµ ·
æĢ »
æī ĭ
``` \
æ £
æĺ¯ ä¸Ģä¸ª
è§ Ĥ
ç½ ®
æĻ ¯
ç ģ
æī ¾
ä»¥ åıĬ
éĩ Į
éĽ Ĩ
o l
è® º
æĶ ¯
Ġi t
ä»£ çłģ
æĸĩ åĮĸ
ç ¥
e l
åĩ ½
e x
ä» ·
å¾ Ī
ç ĭ
åĩı å°ĳ
ç¤¾ ä¼ļ
i f
ä» Ģ
ç Ĭ
æ¬ ¡
åĩ½ æķ°
ä¹ Ĳ
åĽ ¾
ä¹ ī
è¯ ´
è®¾ è®¡
l a
éĿŀ å¸¸
ä»Ģ ä¹Ī
æĸ¹ éĿ¢
ä¸ª äºº
åĲ ĳ
Ġa n
åİ Ĩ
åħ Ī
èĻ ĳ
å¼ ķ
ç ²
g h
é¦ ĸ
éĢ Ł
è £
è Ī
è¿ĩ ç¨ĭ
æĸ Ļ
ç» Ń
çĲĨ è§£
i d
v er
è Ħ
çĶ¨ äºİ
um b
A I
è İ
ä¿Ŀ æĬ¤
åĪ Ļ
æ¸ ¸
ç¬ ¦
åħ¶ ä»ĸ
è§£ åĨ³
æ ĵ
ç ¯
æĶ ¶
m ent
åĲ ¦
å® ¢
] \
ct ion
åİ Ł
éĩ ĳ
åħ³ äºİ
åħ į
éĢ ł
éħ į
Ġ\\ (
å £
èĩ ´
; \
Ġd e
éĻ ©
äºº ç±»
Ġ P
åħ· ä½ĵ
æľª æĿ¥
i r
çĶŁ æĪĲ
è¾ ¾
ç© º
ç¼ ĸ
ç» ´
åħ ±
Ġw ith
çľ ĭ
or t
er e
Ġ on
ä¿Ŀ æĮģ
èĤ ²
a d
æ® µ
ä¸ ¤
éľĢ æ±Ĥ
é ©
æĽ´ åĬł
å®ĥ ä»¬
ä» ħ
è¯Ń è¨Ģ
å® Į
åĲ Ħ
ç« ĭ
è§ Ĵ
èĩª çĦ¶
äºĨ è§£
Ġ us
æ¨¡ åŀĭ
è® ¤
æİ §
ç Ļ
Ġ $
åħ ī
çĽ ´
ä¸ ĵ
a b
i m
Ġw h
éĻ ħ
çĶ ±
å§ ĭ
\\ )
çķ Į
ä»¥ä¸ĭ æĺ¯
é Ĵ
è¯ Ħ
è± ¡
æİ Ĵ
è¯ į
å¹ ¿
è ĭ
æĢ Ŀ
åĳ ³
åı £
æľº åĻ¨
å¸ ¦
æĪ ĺ
k e
æ¡ Ī
ç» Ĩ
èĥ½ åĬĽ
éļ ı
re s
ç Ī
å¿ «
ç¯ ĩ
èĢĥ èĻĳ
çĬ ¶
å° ±
Ġe x
Ġ li
æĸ ½
é ĵ
èµĦ æºĲ
åĩ ł
è ı
ex t
c k
åºĶ è¯¥
è½ ¬
i v
ç´ ¢
ç® Ģ
çĽ® æłĩ
p p
åĲ «
åĮ» çĸĹ
éĺ Ł
p t
åķ Ĩ
è® °
éĶ ®
Ġ |
åĪ Ĵ
éģ ¿
Ġm o
æķĻ èĤ²
ä½ł çļĦ
æ´» åĬ¨
é »
u e
å¯¹ äºİ
ç§ ¯
æ ¼
åİ »
éĻ Ĳ
åĲ Ĺ
è¶ ³
è¯ Ŀ
æĺ¯ åĲ¦
Ġa re
æ¸ ħ
è½ ¦
Ġ le
æ» ¡
æķ ħ
Ġ 5
åı¯ä»¥ å¸®åĬ©
åı ¸
çĹ ħ
åģ ļ
åĽ ¢
çķ ¥
ä¹ĭ éĹ´
a y
è¯ ģ
åį ĩ
ç» ĥ
Ġ 4
å· ²
æĶ ¿
è Į
åĬŁ èĥ½
åı¯èĥ½ ä¼ļ
ä¸ ī
æĪĸ èĢħ
åĳ Ĭ
äº§ åĵģ
éģ¿ åħį
åĵ ª
ri nt
æ£ Ģ
æŀ ģ
è® ¸
èİ ·
åĽł æŃ¤
æĥħ åĨµ
æĶ¯ æĮģ
æµ ·
æĹ ħ
m a
åĨħ å®¹
å¾ ĭ
ä¸ ĸ
æķĪ çİĩ
æľ Ľ
ä¸į ä»ħ
åº ĵ
è¾ ĥ
äº Ĵ
çī¹ å®ļ
å ĥ
è£ ħ
gh t
èĩªå·± çļĦ
Ġn e
åı ª
ç ¦
ä¸ Ķ
è® Ń
èģ Ķ
åı ¥
Ġi nt
Ġn umb
Ġ H
çİ¯ ä¿Ŀ
å¸Ĥ åľº
äº «
ä¼ĺ åĮĸ
ä¸» è¦ģ
ç ħ
o m
æĿ ¡
åħ¬ åı¸
ä»» åĬ¡
į ä½ľ
ä½ İ
æ² ¡
éĩ ĩ
åħĥ ç´ł
Ġ {
- -
Ġs e
å¢ŀ åĬł
æĽ´ å¥½
æĺ ĵ
è· ¯
æĢ§ åĴĮ
æĺ Ł
éª ¤
çł Ķ
è´ ¹
è¯ »
Ġa l
äºº ä»¬
åĥ ı
ĠT he
in d
æĿ Ĥ
åĳ ½
æ² »
ç»ĵ æŀľ
ãĢ ĭ
ãĢ Ĭ
Ġco n
åı ²
a me
ç®Ĺ æ³ķ
å¯¼ èĩ´
åŁ İ
è¶ £
è´¨ éĩı
éĶ Ļ
è¯ ¯
åıĺ åĮĸ
æį ¢
ur n
mp le
èı ľ
ä¾ ¿
æľī æķĪ
æİ ¢
è¿Ļ ç§į
åĽł ä¸º
åħ³ éĶ®
è°ĥ æķ´
è¶ Ĭ
e m
è½ »
ã Ĥ
æĽ´ å¤ļ
ç ¿
åį ³
Ġ he
çļĦæ ĥ
Ġw e
Ġ 0
1 0
æĿ ĥ
ul t
æ¸ ©
a v
è§ ģ
r ing
ç» ľ
æĸĩ ä»¶
æĿ Ĳ
å·¥ åħ·
åĸ ľ
æ²¡ æľī
æ³¨ æĦı
ç Į
a ge
ç½ĳ ç»ľ
éĻ ¤
æĽ´å¥½ åľ°
æĮģ ç»Ń
ç© ¶
åı °
æı ı
ä¸Ń åĽ½
çĽ¸ åħ³
åĪ© çĶ¨
å¯ Ĩ
æĵ įä½ľ
èĩ ³
çŃĸ çķ¥
( )
æ¬ ¢
Ġ l
ä½ł åı¯ä»¥
çī ĩ
å¤į æĿĤ
åĽ¢ éĺŁ
i le
a m
èĲ ¥
åħ ħ
é¦ĸ åħĪ
æŁ Ĳ
é£İ éĻ©
es s
æīĢ æľī
æ¶ Ī
èĩª åĬ¨
ç§ĳ æĬĢ
Ġre t
å Ķ
Ġ M
ç Ł
è¡Į ä¸º
u b
at a
ä¸º äºĨ
Ġm a
å¼Ģ åıĳ
ç ¢
ç² ¾
Ġ \
it y
ro m
åĪĽ å»º
èĬ ±
è ĳ
ç¥ ŀ
ä¹ ¦
å¸ Į
Ġi f
åĲ ¸
Ġ F
" }
è¯ ¢
ä¼ °
æī ĵ
æİ§ åĪ¶
æŃ¥ éª¤
é ¸
l d
æķħ äºĭ
çĦ¶ åĲİ
un ction
æĤ¨ çļĦ
éĢĤ åĲĪ
æĸĩ æľ¬
æĬ ķ
æ Ĳ
åİ ĭ
' s
ç¨ĭ åºı
å° Ŀ
ï¼ ģ
çŃ Ķ
ä»İ èĢĮ
é¡¹ çĽ®
åİĨ åı²
Ġret urn
çļĦæ Ĭ
å¸ ĥ
åħ³ ç³»
ä¸įåĲĮ çļĦ
o d
åı ·
åĬ ¿
ä½ľ ä¸º
ç±» åŀĭ
åĩĨ ç¡®
èī º
Ġ #
2 0
Ġc h
åŃĹ ç¬¦
çĥ Ń
ä¸ĸ çķĮ
Ġb y
æĸ° çļĦ
åĪĹ è¡¨
æľ Ī
as e
çĭ ¬
ç¬ ¬
æĪ ı
n åľ¨
çĽ ĳ
é¥ ®
e st
éĩ Ĭ
å¼Ģ å§ĭ
ĳ æĪĺ
ç»ĵ æŀĦ
çļĦ å½±åĵį
è®¾ å¤ĩ
æ ĳ
æĺ¯ä¸Ģ ç§į
P ython
Ġh a
å¤ ª
c i
çĪ ±
è ŀ
éĤ£ ä¹Ī
è¾ĵ åħ¥
å¤ ±
ä¿ ĥ
u re
æ ¤
éĺ ²
ä¸į æĸŃ
Ġ B
ä» ½
çļĦ æĺ¯
f or
Ġ D
n p
è¯Ĩ åĪ«
åı¯ä»¥ éĢļè¿ĩ
å Ĥ
éĶ Ģ
ä¸ĵ ä¸ļ
ra c
å¯ »
å®ŀ éĻħ
åħ »
æ ļ
å½ ķ
éŁ³ ä¹Ĳ
æī¾ åĪ°
èģ Į
å¼ Ĥ
åĽ ´
çļĦæĥ ħ
æµ İ
å¯ Į
åŁİ å¸Ĥ
å¸¦ æĿ¥
çº ¦
è§ ī
æ ħ
å°Ŀ è¯ķ
u p
åħ ´
æķ° åŃĹ
éĥ¨ åĪĨ
ç»ı æµİ
ä½ĵ éªĮ
in e
å¸ Ī
æıı è¿°
åĮħ åĲ«
è¯Ħ ä¼°
\\ [
å½ĵ çĦ¶
p ython
å·² ç»ı
åŃĺ åľ¨
èŀ į
éļ ¾
è´ Ń
Ġ E
n T
èį Ĳ
Ġ r
å ĭ
h is
ĠĠĠĠ ĠĠĠĠĠĠĠ
èĤ ī
å¿ µ
æľī åĬ©
Ġm e
} {
å¸Į æľĽ
i ve
} \
åĽł ç´ł
ä¼ ģ
i nt
çłĶ ç©¶
æ£Ģ æŁ¥
æĬ ¥
é ¤
åħ· æľī
æľīåĬ© äºİ
lo w
å¿ ħ
ä¸¤ ä¸ª
Ġth is
æĢ§ èĥ½
é¢Ħ æµĭ
Ġnumb er
èĭ ±
çĻ ½
a ct
Ġ si
or d
æ¯Ķ å¦Ĥ
ª æĸ½
f rac
éĺ ³
Ġ W
å®¢ æĪ·
Ġn ot
Ġ [
ä¿ ®
äº§ çĶŁ
åħ ĭ
è®Ń ç»ĥ
t er
ä¸Ģ ç¯ĩ
èº« ä½ĵ
ä¸Ģ ä¸ĭ
è¿Ĳ åĬ¨
åŃ¦ çĶŁ
æŁ ĵ
éĹ ¨
åĬ ±
ä»¥ä¸ĭæĺ¯ ä¸ĢäºĽ
Ġf unction
æĺ ¾
æŃ¤ å¤ĸ
åı ĭ
æ¯ı ä¸ª
å»º ç«ĭ
è¡¨ è¾¾
æ³ Ľ
§ è¡Į
Ġ <
è®¸ å¤ļ
å ¡
è®¡ åĪĴ
éĶĻ è¯¯
åĨ į
æĸ¹ æ¡Ī
å¤ ´
åĲĪ ä½ľ
åĳ ¨
çļĦ åıĳå±ķ
Ġp o
çħ §
è¿Ļ æł·
è¿ ĳ
ä¿ĥ è¿Ľ
é¤ Ĳ
Ġs o
æİ¨ èįĲ
åħ¨ çĲĥ
æ ¿
è¯ Ĺ
ab le
æ Ĵ
çº §
äº Į
ä¼ģ ä¸ļ
v i
ç»Ļ æĪĳ
åĪĽ æĸ°
åĲĦ ç§į
Ġ{ \
a nt
ç§ °
** :
éĻ į
Ġ 6
ç ª
æ¼ Ķ
å®Į æĪĲ
çŁ¥ è¯Ĩ
åĿ Ĺ
ä¸Ģ ç§į
ou r
e ct
ç§ĳ åŃ¦
æµĭ è¯ķ
åĲ ¬
n g
æ¸¸ æĪı
çļĦ åºĶçĶ¨
è ħ
åĨ³ çŃĸ
çļĦ æĸĩç«ł
Ġ R
æŃ Į
å° ½
éļı çĿĢ
é¢ ĳ
æ¿ Ģ
c ri
ç« Ļ
å¹¿ æ³Ľ
en ce
åĢ Ļ
å± Ĥ
æĪĳä»¬ åı¯ä»¥
è® ¨
ä¼ Ĺ
å¾ ģ
åģ ĩ
çĶµ å½±
Ġa r
si on
æ¬ ¾
i g
å¥ ¹
å¹³ åı°
ï¼ Ľ
ä¹ĭ ä¸Ģ
æī §è¡Į
ï¼Į \
çĽ Ĭ
a ch
Ġ L
Ġf rom
ä¹ĭéĹ´ çļĦ
åĿ ĩ
è¾ ¹
ä»· åĢ¼
è¿ ŀ
è¿ ľ
è Ľ
ä»» ä½ķ
) :\
ä¸» é¢ĺ
Ġyou r
æĮ ī
ä¸ ²
åĤ ¨
æĪĳä»¬ çļĦ
æıĲ åįĩ
ä½Ĩ æĺ¯
ç± ³
åıĤ ä¸İ
è½ ¯
åŁº äºİ
æ° ĳ
å®ļ ä¹ī
èīº æľ¯
i es
é ¼
ã ĥ
p ut
è¯ ī
æ ¢
as s
Ġre s
ç®Ģ åįķ
æľºåĻ¨ åŃ¦ä¹ł
æĮ ĳæĪĺ
ä¼ł ç»Ł
èĥ Į
_ _
ç¤¾ äº¤
Ġs pe
ic h
æİ ªæĸ½
è´ Ł
e f
è¡ ¡
ç¦ »
åŃ £
åĪ¶ å®ļ
è¾ĵ åĩº
"} ]
n æĢ»
çī Į
ä½ľ çĶ¨
åį ı
c l
åħ¶ ä¸Ń
åĸľ æ¬¢
åı ¤
il l
o o
" ,
è§£ éĩĬ
å· §
å£ °
ç¤º ä¾ĭ
å· ®
åıĳ çİ°
åĮ» çĶŁ
å¾ Ģ
è¡Į ä¸ļ
ic e
( "
Ġ qu
i st
è¯ ¦
Ġ lo
åĩł ä¸ª
çİ° åľ¨
i me
Ġ /
çļĦ äºº
èĮ ĥ
ar t
æĭ Ł
è¿ĩç¨ĭ ä¸Ń
åº Ń
å¾ ª
u d
for m
æĿ ¾
éļ Ĳ
åĵª äºĽ
åĪ° äºĨ
å¤ ı
çĶ »
å¿« éĢŁ
çļĦ éĹ®é¢ĺ
Ġ N
çĽ´ æİ¥
æ²» çĸĹ
èĥ½ æºĲ
æĬķ èµĦ
çļĦæ İ
è´ £
åŁº æľ¬
æĤ¨ åı¯ä»¥
Ġha ve
è¾ ĳ
æĥħ æĦŁ
æŃ£ ç¡®
åĨĻ ä¸Ģç¯ĩ
æī į
p er
d u
mp ort
f er
Ġd o
th er
äº¤ éĢļ
è° ¢
åĳ ¢
åŃĹç¬¦ ä¸²
an g
éģ ĩ
æľĢ åĲİ
çľ Ł
çļĦ æķ°æį®
çº ¢
æĪĲ æľ¬
æĪĳ æĥ³
cri pt
ou t
** \
æ² ¹
ç§ ģ
. '}]
t ext
èĳ Ĺ
å± ±
ç¡® å®ļ
çļĦ éĩįè¦ģ
çļĦæ Ħ
å¦Ĥæŀľ ä½ł
è¡¨ ç¤º
if ic
è¯¦ ç»Ĩ
å¿ĥ çĲĨ
å®ļ æľŁ
s o
ç» Ī
èį ¯
è®¤ ä¸º
åŁ ¹
å¢ŀ å¼º
èĽ ĭ
éĩĩ åıĸ
u nt
i p
å ¨
æ· »
å®¶ åºŃ
åĪ¶ ä½ľ
ç¼ĸ ç¨ĭ
åŃ ©
æĪĲ ä¸º
åĸ Ħ
ç» ĩ
a re
ä¹ °
b le
ç ı
al ue
è¦ģ æ±Ĥ
æĿĲ æĸĻ
i z
ä¸ °
i ght
å¥ ³
Ġ x
Ġ cont
Ġs u
Ġa d
ç¿ »
è§Ĵ èī²
åħ± åĲĮ
åı¯èĥ½ éľĢè¦ģ
æıĲä¾Ľ äºĨ
Ġ k
an s
æİ¢ ç´¢
a in
æ³ķ å¾ĭ
Ġ \'
å¤ļ ä¸ª
èī ¯
æıĲ åıĸ
ar y
æĸ ¯
" \
å¤§ çļĦ
å ²
ç§¯ æŀģ
äººå·¥æĻºèĥ½ æĬĢæľ¯
å¾ ·
Ġe n
ä» ¤
æĿ¡ ä»¶
è ¥
äº ī
èĢ ģ
è¯ Ĭ
éĵ ¾
ä¼ ¼
at h
a mple
åĪĨ ç±»
à ¸
éĺ ħ
è¥ ¿
åĪĽ éĢł
av a
æķĪ æŀľ
ç§ »
å¾ ®
åħ³ æ³¨
è®¾ ç½®
çĶŁ çī©
ç¨ ³
è¯ ĳ
åĬł åħ¥
æ¶ ī
ä» ĭ
é¥® é£Ł
çİ° ä»£
åĩ »
ç« ¯
Ġwh ich
çĶŁ äº§
åĪ ĩ
Ġ G
èİ· åıĸ
Ġs h
é ²
åİĭ åĬĽ
éĢĤ åºĶ
å ª
åıĤ æķ°
im es
åľº æĻ¯
åĩº çİ°
é¦ Ī
ĠT his
o re
r y
å¤§ éĩı
) ;\
åħ´ è¶£
éĩįè¦ģ çļĦ
¾ çĹħ
çļĦæ °
è® ¿
a c
çģ µ
00 0
çŁ Ń
åŃĺ åĤ¨
åħ ¸
a p
åĳĬ è¯ī
¡ æŁĵ
åĩĨ å¤ĩ
åŁº ç¡
åŁºç¡ Ģ
ä¸° å¯Į
i al
å± ŀ
é¦ Ļ
Ġne ed
a g
é«ĺ æķĪ
åıį é¦Ī
äºº çļĦ
> \
æ¶ī åıĬ
å¦Ĥæŀľ æĤ¨
u st
é¢ Ŀ
åĶ ®
Ġ J
r t
è®¡ç®Ĺ æľº
çļĦæ ł
ou ld
å¼ ł
åĵģ çīĮ
çļĦæ Ķ
np rint
Ġco m
æ ½
å® ³
è½¯ ä»¶
ä½į ç½®
é¼ ĵ
Ġ1 0
åĪ Ŀ
æľº ä¼ļ
Ġa t
Ł éĢļ
åº¦ åĴĮ
ä¸Ĭ çļĦ
æĹł æ³ķ
ä¸į æĺ¯
çļĦæĬ Ģ
l ic
æ·» åĬł
åıĹ åĪ°
çļĦæ Į
å¤© æ°Ķ
u nd
åª Ĵ
æĪ ¿
æĬĢ èĥ½
èĲ ½
Ġ *
ä¸ª æĢ§
å¾Ĺ åĪ°
e p
èĥĮ æĻ¯
ï¼ī ï¼Į
si t
çģ «
çļĦæ Ń
éĥ½ æĺ¯
åĬ¨ çī©
æ ¦Ĥ
Ġmo re
Ġ O
ç»Ħ ç»ĩ
çŃī çŃī
æŁĲ äºĽ
ç¨³ å®ļ
è¡¨ çİ°
çĭ Ĺ
å¹ ²
çĸ ¾çĹħ
éĿ Ļ
è¿ Ķ
æ¨¡ å¼ı
æ¤ į
å¾Ī å¤ļ
åı ¦
ic al
**ï¼ļ \
ä»· æł¼
é£Ł çī©
\\ ]\
å¾ Ħ
çī¹ å¾ģ
è¯Ĭ æĸŃ
i re
çī Ī
è® ²
æĹħ è¡Į
n éĢļè¿ĩ
çļĦæ ī
è½¬ æį¢
å¾ ħ
æĽ´å¤ļ çļĦ
Ġ 8
çĬ¶ æĢģ
åľ° çĲĥ
ç´ §
Ġli st
n i
èİ· å¾Ĺ
æŀ Ĺ
æĶ¿ çŃĸ
æ± ¡æŁĵ
ra y
äº¤ æµģ
ç» ¿
åį °
é» ĳ
le s
äº ĳ
æŃ ¢
è½ ½
Ġp rint
èµ Ľ
Ġ j
è¿ ½
ç³ ĸ
Ġ Ð
Ġ un
è®° å½ķ
æĪĲ åĬŁ
å¹¶ ä¸Ķ
è¶ ħ
é¢ ľ
Ġ 7
è®¿ éĹ®
? '},
ation s
çª ģ
è¿Ĳ è¡Į
c ess
, \
ç½ĳ ç«Ļ
ä½¿ å¾Ĺ
è¿Ķ åĽŀ
l p
æł ĳ
å Ħ
ä¾ Ŀ
ç Ĩ
é¼ĵ åĬ±
æķ° ç»Ħ
ç»´ æĬ¤
æ·± åº¦
æĿ¥ è¯´
åªĴ ä½ĵ
ä¸ ¥
ar d
f t
ä½ľ åĵģ
åº ľ
æĪĳä»¬ éľĢè¦ģ
ç¾ ¤
Ġco mp
Ġf ind
å¤ļ ç§į
æĤ £
æ»¡ è¶³
næĢ» ä¹ĭ
é ¾
o p
è¯· éĹ®
å± ħ
å ¦
åĽ Ľ
Ġc al
æŀ ¶
éĢ Ĳ
å ł
ç¼ ĵ
Ġp er
éģ µ
çĶµ åŃĲ
ä¸ªæĢ§ åĮĸ
çļĦ ä¸Ģ
çŁ¥ éģĵ
éĺħ è¯»
éļĲ ç§ģ
çļĦ åľ°
ä¸ ½
è¯ ¾
åĪĨ äº«
Ġd ata
å¥ ĩ
åĽ¾ åĥı
éħ Ĵ
Ġspe c
è´ ¢
æİĴ åºı
æķ° éĩı
çİ ©
ç¼ º
è· µ
or k
è´Ń ä¹°
æĽ ²
åį Ĺ
çĶŁ æĢģ
æĽ´ æĸ°
a nd
an ge
åı¥ åŃĲ
éĩĳ èŀį
èģĶ ç³»
èģĮ ä¸ļ
å£ «
çļĦ ä¿¡æģ¯
åŃ© åŃĲ
æłĩ åĩĨ
å®ŀ è·µ
æķ° åŃ¦
åģ ı
åĪ »
è¶ ĭ
å® ¤
å° Ķ
äºĭ ä»¶
e g
å° Ĭ
ç» į
é¢ľ èī²
le ment
å¸¸ è§ģ
on e
çļĦæ µ
ä¸Ģ èµ·
ä»ĸä»¬ çļĦ
n ame
ä»ĭ ç»į
c ul
åĽ Ń
æĶ¿ åºľ
ç¿» è¯ĳ
é£ ŀ
n I
èĩª æĪĳ
æ´ ģ
å± Ģ
çļĦ æĸ¹æ³ķ
a k
æĶ¹ åıĺ
at ed
ä¸º æĤ¨
åĽ½ å®¶
Ġe ach
Ġhe lp
åĽŀ çŃĶ
æĭ ī
Ġh as
ç» ª
è Ń
åı¯ä»¥ ä½¿çĶ¨
åĪ ¤
æľ ĭ
t imes
é¸ ¡
çĭ¬ çī¹
è¶ĭ åĬ¿
ç» ¼
åģĩ è®¾
Ġus e
1 2
ä¹Ł æĺ¯
æĪĲ åĳĺ
åı¯ æĮģç»Ń
g n
é£İ æł¼
. "}]
åĳĺ å·¥
å±ķ ç¤º
æĢ§ çļĦ
éĢŁ åº¦
éļ ľ
åĳĬè¯ī æĪĳ
çļĦæ Ļ
Ġ çļĦ
æĹ ı
Ġli ke
çļĦæ ²
å¹³ è¡¡
ä¸ ´
ion s
ä» Ĭ
i o
e w
æĶ¶ éĽĨ
ç« ŀ
æĹħ æ¸¸
d er
çī¹ åĪ«
æĺ¯ åľ¨
ä»¥ ä¸Ĭ
çĥ ¤
äº Ķ
æŁ¥ è¯¢
é© ¬
åĽ °
åıĳ çĶŁ
åĲ¸ å¼ķ
æĻ ®
æľĭ åıĭ
æĺ¯ ä»Ģä¹Ī
è¿ŀ æİ¥
å®ļ çļĦ
Ġ la
å¯» æī¾
æĺİ ç¡®
æľºåĻ¨ äºº
æŀĦ å»º
o de
æĭ ¥
åľ¨ çº¿
æ¯ į
æ¯Ķ è¾ĥ
er m
ä½ ı
è¿Ļ éĩĮ
èĮĥ åĽ´
æĳ Ħ
l l
å¿ Ĺ
a ck
åľ° åĮº
å®ī è£ħ
Ġ ro
æ³ ¢
Ġa b
p h
æĦŁ åĪ°
é Ĩ
ĠI f
æĬĢ å·§
æ ¹
. '},
Ġ sta
çļĦæ ¸
è¡Į åĬ¨
æ·± åħ¥
5 0
Ġa c
å¤ª éĺ³
nd ef
å½ Ĵ
t al
ç¥ ¨
éĥ½ æľī
ä¸Ģ æŃ¥
å½ĵ åīį
èĻ ļ
åį ¡
éªĮ è¯ģ
ä» ĺ
ç¤¾ åĮº
çĶŁ åĳ½
æµģ ç¨ĭ
ä¸Ģ æ¬¡
Ġh ow
é² ľ
æķ £
é» Ħ
ç ĳ
åĬĽ åĴĮ
Ġa pp
Ð ¾
åĨĻä¸Ģç¯ĩ åħ³äºİ
å½¢ å¼ı
è ª
æĿ ¿
ç»ı éªĮ
çĦ¶ èĢĮ
ä»¥ ç¡®ä¿Ŀ
ä¸Ĭ è¿°
Ġw ill
éĢ »
èĦ ĳ
c es
æĢ İ
æĤ£ èĢħ
vi de
è¿ĺ æľī
éĻį ä½İ
åĮ Ĺ
r it
é ±
è®¨ è®º
g ra
ir st
éĢ» è¾ĳ
åĦ ¿
ĠP ython
Ġto tal
f f
é© ¶
ç©º éĹ´
Ġm an
éĻĲ åĪ¶
é± ¼
åºĶ å¯¹
åĬ ª
åħ·ä½ĵ çļĦ
æĴ Ń
äºĨ ä¸Ģä¸ª
ä¾ĭ åŃĲ
çļĦæĥħ åĨµ
Â ·
Ġ U
è§Ħ åĪĴ
ä»¥ ä¾¿
éĢ ı
å® Ŀ
ä¹Ł åı¯ä»¥
e ar
er t
æĪĳ åı¯ä»¥
åĳ ¼
æīį èĥ½
æĢĿ èĢĥ
å¤ ľ
åĲĪ çĲĨ
å½¢ æĪĲ
æī ¿
å¥ ¶
ľ ç´¢
èį ī
è¿Ļ ç¯ĩ
åģļ åĩº
ï¼Ł \
Ġpro vide
æ½ ľ
Q L
çĮ «
èĻ ½
Ġspec ific
r u
Ġus ing
é¡ µ
è¿Ļ æĺ¯
æķ°æį® åºĵ
çĶŁæĪĲ ä¸Ģä¸ª
æĥ ¯
Ġ 9
at es
åĴ ĸ
è§Ħ åĪĻ
æľĢ ç»Ī
Ġo ut
æ¸ Ĳ
éĶĢ åĶ®
å½ ©
åı ¶
æĥ³ è¦ģ
æ°´ å¹³
å½ĵçĦ¶ åı¯ä»¥
çī¹å®ļ çļĦ
è§£åĨ³ æĸ¹æ¡Ī
n s
æĹ¥ å¸¸
åį İ
ä¸ĭ éĿ¢
åĪĽå»º ä¸Ģä¸ª
äº ļ
åİŁ åĽł
è¡ Ģ
å¤ļ æł·
å¿ħ è¦ģ
ĠH ow
å¯¹ è¯Ŀ
è Ķ
èĻ½ çĦ¶
ç¼ĸ åĨĻ
æ´ ĭ
lo g
åĴ ¨
åħħ æ»¡
n S
æľī åħ³
P I
åº Ĺ
è´£ ä»»
åĴ¨ è¯¢
éĴ Ł
çī Ľ
he n
åĲĪ éĢĤ
çļ ®
Ġco de
li st
åĨ ľ
å° Ħ
éĢ ģ
ä¹ł æĥ¯
o s
åľ Ł
åĿ ļ
çŃ ĳ
æľº åĪ¶
è¯¾ ç¨ĭ
åĨ ²
å® ¡
iv en
è¿ĺ æĺ¯
å°Ĭ éĩį
æ² ŁéĢļ
ĥ åľ
S S
åŀ ĥåľ
åŀĥåľ ¾
å½ĵ åľ°
ic t
è¿Ļ ä¸Ģ
ï¼ī \
Ġan y
åī §
çĶ± äºİ
çī© è´¨
re e
æĦı è¯Ĩ
æ¯ı ä¸ªäºº
Ġres ult
åıĺ éĩı
åķ ¡
Ġst ring
çļĦç ¾
æŃ£ åľ¨
è Ĵ
æ¶Ī è´¹
ç² ī
Ġe qu
çĹ ĩ
çĦ ¦
å¾ª çİ¯
AI æĬĢæľ¯
å¼º è°ĥ
åĽ½ éĻħ
Ġb ut
èµ· æĿ¥
å»º çŃĳ
ä»£ è¡¨
Ġc l
è ĵ
çļĦæ ³
è· Ŀ
æļ ĸ
é© ¾
j ect
åįķ è¯į
Ġn um
() `
Ġ/ /
å¯¹ è±¡
éĴ Ī
åĬł å¼º
g et
ç»ĵ åĲĪ
æĹ¥ æľŁ
èĦ ļ
æĥħåĨµ ä¸ĭ
å¯» æ±Ĥ
åĴĸ åķ¡
Ð µ
æĦı åĳ³
Ġad d
çļĦæ ¯
æĸ¹ åĲĳ
Ġt e
Ġ ä½¿çĶ¨
çľ ł
ç ĵ
ç¤¾äº¤ åªĴä½ĵ
çŃī æĸ¹éĿ¢
åĲ ĥ
en er
y st
m at
æīĢ ä»¥
èĩªåĬ¨ åĮĸ
Ġex p
æĸĩç«ł ä¸Ń
Ġ2 0
Ġc re
èĪ ŀ
Ġt r
æķ°æį® çļĦ
æĮī çħ§
æĶ¹ åĸĦ
âĢĿ ï¼Į
åĲį ç§°
ä½ł èĥ½
Ġne w
co m
é Ń
æİ¨ åĬ¨
åķĨ åĵģ
Ġus ed
è± Ĩ
æĲ ľç´¢
al l
æ°Ķ åĢĻ
è¿Ľ æŃ¥
Ġex ample
æĦıåĳ³ çĿĢ
t e
æĺ ¥
æ¤į çī©
ä½ ³
æĽ ¿
al ly
ç¬¦ åĲĪ
Ġ }\
ĠI t
Ġco l
èį¯ çī©
å¤§ å°ı
ä¼ ¤
åĮ» åŃ¦
or y
ç«ŀ äºī
Ġnumb ers
ç ĩ
äº ¬
èĩªçĦ¶ è¯Ńè¨Ģ
æį Ł
åľ¨ åĮ»çĸĹ
Ġ\\ ]\
éĿ¢ å¯¹
ä¸ ¾
Ġt w
çĸ «
æĪĳ çļĦ
æī ©
T he
co n
æĶ¹ è¿Ľ
çĮ ®
em s
Ġal l
æ¡ £
ç¦ ı
å® ĺ
åĬª åĬĽ
å· ´
åıį åºĶ
è¯Ń éŁ³
ç Ł³
æľº æŀĦ
" )\
ç»ĥ ä¹ł
ä¸ ľ
åı Ī
æĿ¥ è¶Ĭ
èĪ ª
è¶Ĭ æĿ¥è¶Ĭ
åĪĽ ä½ľ
er v
ent s
åĲ §
éģĵ å¾·
ç§ ĭ
éĩĩ çĶ¨
èµ °
æĻ ļ
è Ĺ
n umb
æľī ä»Ģä¹Ī
-- --
é º
åıĺ å¾Ĺ
ä¹ ĺ
äºĴ åĬ¨
ç®Ģåįķ çļĦ
ç¤ ¼
éķ¿ æľŁ
èĤ ¡
an ce
ĠS t
èĲ¥ åħ»
çļĦç¾ İ
åı Į
ĠĠĠĠ ĠĠĠĠ
æ± ½
é¡ ¾
## ##
éĤ ®
§ è§Ĩ
æıĲä¾Ľ æĽ´
æł ¸
æĪĲ éķ¿
ç» §
çļĦæĦ ı
æ·±åº¦ åŃ¦ä¹ł
åŁ¹ è®Ń
ä»¥ä¸ĭ åĩłä¸ª
n um
å¯ Ł
ä¸į èĥ½
éħį ç½®
æ ©
éĢ Ĵ
æľī æīĢ
æĬ Ĭ
ow n
å°Ĩ ä¼ļ
çķ Ļ
S t
çĲĨ è®º
ç»Ļ åĩº
Ġthe ir
äº¤ æĺĵ
Ġ ra
æľĢ å¤§
é©¾ é©¶
æĶ¾ æĿ¾
Ġin cl
éĽ ¨
å¤© çļĦ
ä¼ ¦
è¶³ å¤Ł
c ur
èģ ļ
æµ ª
ke y
é¡ º
Ġv alue
æĭ¥ æľī
åĨ ·
çĽ ĸ
åĬĽ éĩı
äºĨ ä¸Ģ
s q
Ġs et
çļĦ çĶŁæ´»
æ° §
æ¡ Ĩ
æķĪçİĩ åĴĮ
è´ §
ä¸į ä¼ļ
èĪ Ĵ
éĺ ¶
å¨ ģ
k s
æİ¥ åıĹ
J ava
å® Ī
åĲĮæĹ¶ ä¹Ł
n ce
èĶ ¬
ç³» åĪĹ
æĹ ©
1 00
Ġde f
it ion
çļĦ åħ³éĶ®
Ġ= =
he ck
æľī è¶£
ç§ ĺ
é£Ł åĵģ
åį ģ
a st
. .
åĲ ¯
åĨ³ å®ļ
éķ¿ åº¦
äºº åĳĺ
Ġ| \
åĲİ çļĦ
Ġs um
äº« åıĹ
åı¯èĥ½ çļĦ
1 5
åĪĨ éħį
å¡ ĳ
Ġ up
3 0
w e
Ġcal cul
åı¯ä»¥ åľ¨
s s
¡ çľł
æħ ¢
Ġv ar
Ġch ar
è§ ¦
Ñ Ĥ
Ġt ime
æĥħ ç»ª
çĬ¶ åĨµ
åĨ °
a il
çİ° å®ŀ
æĺ¾ ç¤º
u es
çŃ ¾
çī¹ çĤ¹
æľĢ è¿ĳ
èĻļ æĭŁ
) ,
è¿Ļ åı¯èĥ½
æķ´ æķ°
èµ ĸ
éĩį å¤į
èĶ¬ èıľ
çļĦ æĹ¶éĹ´
çł ´
éĢĤ å½ĵ
çī© çĲĨ
ä¼ ĳ
è¯Ĺ æŃĮ
Ġd et
çļĦ å·¥ä½ľ
1 9
æ ¥
åħ ģ
çļĦæĬĢ æľ¯
å¹³ åĿĩ
Ġt y
æ¦Ĥ å¿µ
ç© ¿
éĢł æĪĲ
ä¸Ń å¿ĥ
Ġd if
Ġm ight
æķ´ ä¸ª
çĽĳ æİ§
åĪĽ æĦı
ä¸Ģ æ®µ
è ľ
ä¸ ĩ
åĢ ĭ
la y
çļĦ å»ºè®®
Ġm at
Ð °
Ġi mport
åŃ¦ä¹ł åĴĮ
å¸® æĪĳ
åĮĸ çļĦ
éģ į
Ġ åľ¨
åħģ è®¸
çļĦæ ı
æ¸ħ æĻ
æĸĩ æ¡£
ç ¹
Ġ V
w ord
è§Ĩ é¢ĳ
éģĩ åĪ°
ä¿® æĶ¹
è§Ĩ è§ī
ä¼ ´
åĳ½ ä»¤
çĽ ĺ
èģĶ ç½ĳ
å° ¤
éĹ »
å® ĩ
o b
ä» į
æŃ §è§Ĩ
å¿ Ĩ
on g
gra m
æ· ·
è¿ İ
st ring
e ver
æĢ ¥
éĵ ¶
Ġtw o
æĭ ħ
åĨħ éĥ¨
çĭ¬çī¹ çļĦ
( )\
æıĲ åĩº
åº ķ
Ġe lement
çĨ Ł
èĩªçĦ¶è¯Ńè¨Ģ å¤ĦçĲĨ
æľī ä¸Ģä¸ª
ä¾Ŀ èµĸ
t o
è½¬æį¢ ä¸º
è¡ £
Ġo ther
æĹł è®º
åĪĨ éĴŁ
éĢ Ķ
éģ Ĺ
éħ ¸
å·® å¼Ĥ
as h
co unt
æĿ İ
èģ Ĭ
è¿Ľ ä¸ĢæŃ¥
è ¸
éĹ®é¢ĺ çļĦ
n f
è¿ĺ åı¯ä»¥
ni mport
Ġd is
ä¸ī ä¸ª
Ġp art
äº ®
Ġp re
Ġe v
i e
æ´ Ĺ
æ¸© åº¦
Ġw ould
ç¡ ¬
Ġ åĴĮ
Ġs p
Ġso me
æ±½ è½¦
ä»ĸ çļĦ
åĳ¼ åĲ¸
èĲ¥ éĶĢ
æķ ı
nd s
ro r
äº ²
Ġf irst
åıĬ æĹ¶
éĿ ł
k ing
æľªæĿ¥ çļĦ
ä¸į åı¯
è§Ĥ çĤ¹
åľ Ĩ
å¼Ĥ å¸¸
nT he
Ġf e
Ġon e
èĮ ¶
è·Ŀ ç¦»
Ġw as
Ġ Y
åĬ ŀ
å°ı è¯´
éĩ İ
ar n
èĩª çĶ±
çļĦç ĥ
æĬĢæľ¯ çļĦ
éĿ¢ ä¸´
v ers
æĢĿ ç»´
Ġit s
ç»ı åİĨ
éļı æľº
Ġs ol
è§ Ī
ä½ł éľĢè¦ģ
ç¢ ³
æĢİ ä¹Ī
èĵ Ŀ
res s
æĺ ł
ãģ ®
Ġb o
éĢ Ļ
åħ¨ éĿ¢
le ase
å®ĥä»¬ çļĦ
çľ ¼
h ere
æľįåĬ¡ åĻ¨
åİ ħ
æĬ¥ åĳĬ
ri ght
2 5
or ld
ï¼ī ãĢģ
æĺ¯ æĮĩ
æľ ¨
åº §
é¦ Ĩ
æľīæķĪ åľ°
å¤ļ å°ĳ
é«ĺ çļĦ
æ² Ļ
ä¸Ģ é¦ĸ
éĢĤ éĩı
Ġre p
Ð ¸
Ġsu ch
å®ŀ éªĮ
è°ĥ çĶ¨
çīĪ æľ¬
ç¥ŀ ç»ı
Ġf ol
å®ŀ æĹ¶
å ©
è®© æĪĳä»¬
å¥ ĸ
æ¯ Ĵ
æ¶īåıĬ åĪ°
å¸®åĬ© ä½ł
T o
åĿ ı
æł ¡
éĢĲ æ¸Ĳ
n A
è® ¢
è´¢ åĬ¡
å®ŀ æĸ½
S cript
è¿½ æ±Ĥ
æ¸ħæĻ °
ä¸į è¦ģ
çĽ¸ åºĶ
é¡ »
æĦ ¿
æ³ķ è§Ħ
ĠI n
åĲį åŃĹ
æķ°æį® éĽĨ
çļĦ éľĢæ±Ĥ
åºı åĪĹ
n e
å® Ļ
ç¾İ åĽ½
Ġal so
èī¯ å¥½çļĦ
è ĸ
ä¸ļ åĬ¡
i de
æĪĳ ä¼ļ
éģµ å¾ª
ä¹ĭ åīį
form ation
ç»Ħ åĲĪ
or s
æł¼ å¼ı
èĪĴ éĢĤ
çļĦ å®īåħ¨
çļĦç ¬
çļĦæ ´
åħ¬ åħ±
å®¹ æĺĵ
åıĤ åĬł
åĽ° éļ¾
c a
è· Ł
å®ĩ å®Ļ
ç»Ħ æĪĲ
çļĦæ ·
yst em
æĹ ¨
M L
S QL
æ¢ ¦
åĨ³ äºİ
åıĸ åĨ³äºİ
åĬ¨ æĢģ
Ġt ra
ä¸Ģ å®ļ
åĪ¤ æĸŃ
åĪĨ å¸ĥ
éĤ® ä»¶
ç± į
æĿ Ł
çŃī é¢ĨåŁŁ
a ce
æĦı ä¹ī
é¥ °
/ /
æĲ Ń
ç§» åĬ¨
Ġf ile
çļĦæ° ´
du ct
Ġb et
ç® ±
åı¯ä»¥å¸®åĬ© ä½ł
ç»§ ç»Ń
Ġint o
çĦ¦ èĻĳ
å· ¨
p y
Ġab out
n è¯·
ï¼ī ãĢĤ\
t t
m y
ou nt
è·¯ å¾Ħ
æ´ ²
çļĦç ¼
Ġdif fer
ç»¿ èī²
ç©º æ°Ķ
çİ ĭ
at ing
éĿ ©
èĽĭ çĻ½
c re
çĽ Ĳ
åŃ ¸
éħ ±
ng th
æĹ ¢
èĦ Ĥ
å¢ŀ éķ¿
éĺ ¿
çļĦ åŃ¦ä¹ł
¢ å¤į
è´ ¦
è Ĩ
éĻ ¢
u al
Ġfol low
æ£Ģ æµĭ
è¿ĺ èĥ½
çļĦ æĸ¹å¼ı
çľĭ åĪ°
el lo
ç¹ ģ
åŃ£ èĬĤ
å¿ħ é¡»
ä»¥ä¸ĭ æĺ¯ä¸Ģä¸ª
éľ ²
çĶ ·
Ġv al
Ġfor m
ä½ł å¥½
è¯· æ±Ĥ
ç» ĺ
æĿ ¯
è´ ¡
Ġk n
m b
æĸĩ åŃ¦
\ ',
o us
å®Į åħ¨
çļĦ ä½¿çĶ¨
åķĨ ä¸ļ
åĽ º
s um
æ°ĶåĢĻ åıĺåĮĸ
) )
æ£ ®
å¦Ĥ ä¸ĭ
å¤įæĿĤ çļĦ
èĩ³ åħ³
æķ°æį® åĪĨæŀĲ
è¯´ æĺİ
"} ,
è· ¨
ar k
ay s
z e
æ¯Ķ èµĽ
è´¡ çĮ®
æĶ¯ ä»ĺ
r ent
åģ ľ
èĹ ı
æīĵ åį°
è¾ ħ
æİ¢ è®¨
éĿ Ĵ
çļĦæĦ Ł
at ive
el l
æľĢ ä½³
ç¨ İ
çº ª
åĭ ĩ
çģ ¯
ï¼ī **ï¼ļ
èĢ Ĺ
f ore
ä¸ĭ æĿ¥
æı ¡
æİ Į
Ġwh ere
å¸ ģ
çļĦæĥħ æĦŁ
å°¤ åħ¶
æ¶Īè´¹ èĢħ
éĺ³ åħī
é Ł
ro w
å°± æĺ¯
è¾¾ åĪ°
èŃ ¦
Ġ1 2
åĮĸ åŃ¦
èĳĹ åĲį
é¾ Ħ
Ġw ord
ä¼ ½
ä¸¥ éĩį
èĢ Ĳ
èĥ½ éĩı
èĬĤ çĤ¹
æ´ ŀ
è¡ ¥
Ġ ì
èĤ Į
çļĦç ł
ä½ĵ çļĦ
Ġthe n
çĽ¸ å¯¹
æīĭ æľº
E R
åį ļ
éĢī é¡¹
åĮº åŁŁ
æĪĳ å°Ĩ
åĮ ¹
åį Ĭ
çĤ ¼
åį «
" :
çĲĨè§£ åĴĮ
çĽĳ æµĭ
åĿ Ĳ
Ġthe y
d ata
èĢĮ ä¸įæĺ¯
ç½ Ĺ
it s
Ġw ork
Ġr ange
è®¾ å®ļ
èĭ± æĸĩ
c al
ä¼ĺ åĬ¿
Ġg iven
æģ ¢å¤į
æŁ¥ çľĭ
ç¨ĭ åº¦
åħ¬ å¼ı
Ġint eg
åĨħ åŃĺ
åį ±
æĮ ¥
ä½ Ļ
èĤ ¤
sta nce
H ello
æ¨¡ æĭŁ
æĮĩ çļĦæĺ¯
åĬ ³
t en
æ± ĩ
Ġin put
Ġcom m
Ġs ub
Ġth an
Ġin formation
æĹ¨ åľ¨
æĤ¨ éľĢè¦ģ
åı£ æĦŁ
çģµ æ´»
Ġ K
Ã ©
Ġc ur
n åĽłæŃ¤
ç £
ç¾İ é£Ł
ç³»ç»Ł çļĦ
æ¡Ĩ æŀ¶
ä¸º ä»Ģä¹Ī
åŁ¹ åħ»
ľ ä¼½
ä¸Ģ ä»½
å¸®åĬ© æĤ¨
Ġre qu
çĽ¸ åĲĮ
èĭ± è¯Ń
éĴĪ å¯¹
Ġar ray
é¸ Ł
è¾ Ĩ
ç»¼ åĲĪ
åĪ¶ éĢł
Ġn ame
åĲĪéĢĤ çļĦ
1 1
æ¶ ²
= "
Ġe l
le d
æħ §
pe nd
th od
çļĦæ ¦Ĥ
h at
ä¼ļ è®®
e b
nd om
å·¥ ç¨ĭ
å®ĥ çļĦ
æ¼ «
p o
æľī çĿĢ
Ġ å°Ĩ
åľ¨ è¿Ļä¸ª
ce pt
le ct
å¹³ çŃī
çİ¯å¢ĥ ä¿ĿæĬ¤
Ġp ri
åĵį åºĶ
i b
t ra
çļĦ æķħäºĭ
se l
å ³
æ½ľ åľ¨
as ed
çļĦæĮ ĩ
Ġg ener
è¿Ļ æľīåĬ©äºİ
ãĢĤ âĢĿ
åĴĮ æĸĩåĮĸ
åı¯æĮģç»Ń åıĳå±ķ
Ġas si
n è¿Ļ
n é¦ĸåħĪ
æ¤ Ĵ
çļĦ é£İéĻ©
ä¸Ń æĸĩ
æ¯ı å¤©
Ġth ere
éĻ¤ äºĨ
æĹ¶ åĢĻ
çī© åĵģ
ä¹¦ ç±į
I D
Ġthe se
Ġm y
æĢ» ç»ĵ
å°Ĩ åħ¶
` ï¼Į
il ity
ä½Ĩ ä¸į
ers on
çĶ¨ çļĦ
æĿ¥ å®ŀçİ°
èī ¾
e nd
çŃĶ æ¡Ī
ç¼ ©
Ġt erm
éĻĲ äºİ
åĮ¹ éħį
p on
u de
æĿ¥ æºĲ
g le
éĿ¢ ç§¯
if y
åı¯ä»¥ è®©
éĺ µ
æ¬¢ è¿İ
æĬ ĺ
æĬ Ĺ
çĽ¸ äºĴ
ul d
çĽ¸åħ³ çļĦ
é¤Ĳ åİħ
åī Ĥ
Ġ und
ul ar
æĺ¾ èĳĹ
d ing
m o
st r
å¹´ é¾Ħ
åºĶçĶ¨ ç¨ĭåºı
Ġco uld
ä¸°å¯Į çļĦ
is h
Ġp ar
ç»Ĩ èĬĤ
å®¶ å±ħ
æĮĩ å¯¼
ut e
er y
å¯Ĩ çłģ
Ð ½
åħ¬åı¸ çļĦ
å°ı æĹ¶
å® ½
Ġa m
éĺ¶ æ®µ
< /
ç¡® å®ŀ
æĢ§ åĪ«
æĶ »
èĪ ¬
æľī å¾Īå¤ļ
å¥³ æĢ§
çļĦæ· ±
nI n
ç¾İ ä¸½
ç» Ŀ
åŃĹ æ¯į
Ġm in
çĤ Ĵ
ou nd
äº¤ äºĴ
æ® Ĭ
åĮĹ äº¬
numb ers
åľ¨ æŁĲäºĽ
Ġw ant
ï¼ļ âĢľ
å» ¶
j s
è§Ĵ åº¦
åĽ¢éĺŁ æĪĲåĳĺ
a pp
åı ³
å¥ ı
æĪĲ ä¸ºäºĨ
çļĦ ä¸»è¦ģ
å¼Ģ æĶ¾
ï¼ģ '},
éĽ ¶
Ġ >
æĪĳä»¬ åºĶè¯¥
H T
çī¹ æ®Ĭ
çİ© å®¶
æ± ł
è¿ĩ åº¦
æı Ĵ
åĴĮ è°
å¹¶ ä¸į
çº ¸
éĩį æĸ°
á »
çĳ ľä¼½
L E
æ ĩ
åħ± äº«
éĽĨ æĪĲ
ä»į çĦ¶
in al
çļĦ åģ¥åº·
è¿Ļç¯ĩ æĸĩç«ł
A PI
ic es
Ġg o
å®ī æİĴ
éĩı åŃĲ
âĢ Ķ
å±ķ çİ°
ä¸Ĭ ä¸ĭ
ï¼Į `
è ©
åĪĨ åĪ«
ar r
é¢Ħ ç®Ĺ
Ġ ```\
: :
çļĦ åħ·ä½ĵ
ä»ĸ äºº
è´Ł éĿ¢
å¹ »
è´Ń çī©
é ĸ
ãģ Ļ
p ro
å®īåħ¨ æĢ§
en s
æī© å±ķ
çĶŁæ´» ä¸Ń
çļĦæ ¨
\\ (
åĵ Ī
ĠHow ever
Ġpro gram
d ate
åıĳ æĮ¥
ä¸Ģ èĩ´
è· ³
Ġt ext
ç»Ļ å®ļ
è· ĳ
ic k
åºĶçĶ¨ äºİ
åħ¶ æ¬¡
éĵ ģ
c he
Ġo ver
ç¬¬ äºĮ
æµ· æ´ĭ
çļĦ çİ¯å¢ĥ
çļĦæ´ »
é¢Ħ éĺ²
é«ĺ åº¦
çĶ ³
éĢı æĺİ
è¯Ń æ³ķ
éĶ »
çĸ ĳ
æĸ¹ ç¨ĭ
èĦļ æľ¬
è®° å¿Ĩ
Ġ\\ )
å· ¦
Ġco unt
d ay
è¿Ļä¸ª éĹ®é¢ĺ
å¡ĳ æĸĻ
åĩı è½»
æľī åĵªäºĽ
æĬ ½
1 8
ĠH ere
åı¯ éĿł
åħ¬ ä¼Ĺ
åĢ ¾
éĶ» çĤ¼
å¿ħè¦ģ çļĦ
æĪĳ éľĢè¦ģ
æİĴ æĶ¾
æ» ©
æķĻ åŃ¦
Ġcont ext
åĨ² çªģ
sel f
åĲį ä¸º
rit e
t y
éĺ² æŃ¢
Ġincl ud
Ġ1 00
å¸¸è§ģ çļĦ
å¤§ åĪ©
Ñ ģ
æĹ ĭ
æĸ° éĹ»
å¹ ¸
çļĦç ģ
v id
è¯ ļ
ä¾Ľ åºĶ
æŃ£ç¡® çļĦ
ult ip
) )\
çı Ń
æ°´ æŀľ
1 6
ä¼ł æĴŃ
R e
å»º è®¾
çī¹ æĢ§
i gh
è§Ĥ å¯Ł
æ¨¡åŀĭ çļĦ
è¸ ª
Ð¾ Ð
çļĦæĬ ķ
åıª æľī
çļĦç ľ
si ble
éĹ Ń
çħ ®
Ġg et
åħ¬ å¹³
çİ° è±¡
Ġco mple
å¼ķ èµ·
ut ion
oo k
æĦŁ åıĹ
åı¯èĥ½ å¯¼èĩ´
re ad
ä¼¦ çĲĨ
åĨ ¥
å° ¼
i a
ç½ ²
Ġd iv
Ġp l
æĲŃ éħį
Ġy ear
ort ed
ç¼ĵ è§£
ç±»åŀĭ çļĦ
Ġman y
n F
çĶ¨ æĿ¥
qu e
åĬł å¯Ĩ
ä¸Ģ ä½į
æ² ³
å®Į æķ´
at er
æľ «
pe ct
æİĮ æı¡
Ġh is
è´¹ çĶ¨
è¿Ļ æĺ¯ä¸Ģä¸ª
æīĢ éľĢ
æ³ ¡
èĽĭçĻ½ è´¨
è§£åĨ³ éĹ®é¢ĺ
æİ¨ å¹¿
éĨ Ĵ
æ¸ħ æ´ģ
A R
ĠC h
s w
çļĦæĮ ĳæĪĺ
æīĵ å¼Ģ
ment s
æĢĿ æĥ³
re d
çļĦæ¨ ¡
è§Ĥ ä¼Ĺ
Ġ user
éľĢè¦ģ æ³¨æĦı
Ġint er
éĶ ħ
èĢħ çļĦ
ç»Ł è®¡
ç¬ ĳ
in es
Ġma x
æľī äºĽ
us e
åİŁ çĲĨ
Ġme thod
s h
ç µ
Ġo b
çĪ± æĥħ
we en
å¸¦æĿ¥ äºĨ
Ġcalcul ate
è§Ħ æ¨¡
èĩ³åħ³ éĩįè¦ģ
çĹ Ľ
åĨ¥ æĥ³
é¢Ŀ å¤ĸ
å¦Ĥä½ķ åľ¨
Ġchar act
çº ³
ä¹ İ
Ñ Ģ
äºĴ èģĶç½ĳ
p s
çŁ ©
çĽ® åīį
sq rt
åĴĮè° Ĳ
åĴĮ ç¤¾ä¼ļ
ä¼ĳ æģ¯
Ġ æĺ¯
åĪ ł
æ·· åĲĪ
el f
åģı å¥½
ĠF or
éģµ å®Ī
ä¹Ł ä¼ļ
Ġtr ans
åĮ Ģ
èº« ä»½
Ġco r
Ġw hen
co l
c y
Ġp h
æį ·
d iv
åįı ä½ľ
la ce
äººç±» çļĦ
åı «
åĨ Ľ
å® £
Ġcl ass
çĻ ¾
Ġpo int
è½¦ è¾Ĩ
å¾Ģ å¾Ģ
åĢ Ĵ
a x
Ġthe m
Ġund er
f ile
æŁ¥ æī¾
çĶ ľ
åĨ Ĵ
Ġc heck
åı£ åĳ³
ä»·åĢ¼ è§Ĥ
ä¿Ŀ åģ¥
æ¹ ¿
åı¯ä»¥å¸®åĬ© æĤ¨
ro u
at or
ä½ Ľ
ä¾ Ĩ
ä½Ĩä¸į éĻĲäºİ
è®© æĪĳ
æīĢ è¿°
æķ´ ä½ĵ
ä¸Ĭä¸ĭ æĸĩ
( '
ï¼ī ãĢĤ
+ +
åĮħæĭ¬ ä½Ĩä¸įéĻĲäºİ
å¹¶ åľ¨
çļĦæ³ ķ
ic s
Ġel se
ma in
çĶŁ éķ¿
çļĦ è¿ĩç¨ĭ
ç¬ Ķ
æī ®
æľīæķĪ çļĦ
åħħ åĪĨ
åĢ ĳ
O N
çļĦæĻ º
çļĦç¼ ĸ
è ³
èµ ı
å° ļ
ä¸ Ŀ
n H
å¹¿ åĳĬ
å° º
ub lic
æŁĲ ä¸ª
m l
çļĦçł Ķ
æľĢ å°ı
å¥ Ĺ
Ġle t
éĢļå¸¸ ä¼ļ
ç²¾ ç¥ŀ
è´ ¥
çľ ģ
æ¿Ģ åıĳ
åı¯ä»¥ æıĲä¾Ľ
Ġpro vid
çļĦéĩįè¦ģ æĢ§
20 2
is e
éĤ£ äºĽ
æĹ¶ æľŁ
âĢĿ ãĢģ
åİŁ åĪĻ
ro n
Ġbet ween
ç»ı åħ¸
Ġqu est
C T
å¤ı å¤©
Ġdiffer ent
æ¨¡ åĿĹ
åĨĻ ä½ľ
çļĦåľ° æĸ¹
é¡º åºı
è®¾ æĸ½
åĿ Ģ
ire ct
æ»¡ æĦı
æ£® æŀĹ
åı¦ å¤ĸ
çĻ »
æķ ¸
ä¿¡ ä»»
Ġs ent
å®ĺ æĸ¹
éĵ¶ è¡Į
èĢĮ ä¸Ķ
åĪł éĻ¤
çĿ ¡çľł
æ³¨ éĩį
± ä¹Ĳ
èĥ ľ
ç¼ĸ è¾ĳ
çĽ´ åĪ°
ci al
ä¸Ĭ æīĢè¿°
çĶµ èĦĳ
nT his
è¡¨ æł¼
r ue
è¾ħ åĬ©
åıĳ å¸ĥ
å·¥ ä¸ļ
æµ ĵ
çĩ ĥ
èī² çļĦ
å¤§éĩı çļĦ
Ġdo es
é¡µ éĿ¢
è¡¨ éĿ¢
è¾ £
it e
de x
éģį åİĨ
é¾ Ļ
o c
åį ´
åı¯ä»¥ æıĲé«ĺ
ç±» ä¼¼
èĤ¡ ç¥¨
æĻ Ĥ
çĥ Ī
åĮº åĿĹ
åħ °
ang u
ç»¼ ä¸ĬæīĢè¿°
è½ ®
ä¿¡ åı·
éĢ Ģ
åį ·
è¯Ŀ é¢ĺ
âĢĿãĢģ âĢľ
Ġpro cess
Ġcur rent
a ke
éĥ¨ ç½²
æİ¥ ä¸ĭæĿ¥
o h
è¿Ļ å°Ĩ
åĲĦ ä¸ª
ä¹ ħ
çģ ¾
è° ±
æĽ´ å¥½çļĦ
æĳĦ åħ¥
ï¼ļ '},
6 0
éĥ½ èĥ½
ç¿ Ĵ
æķ° çļĦ
' re
I n
éľĢè¦ģ èĢĥèĻĳ
æ² ī
æĻº æħ§
Ġs elf
rou gh
æĺĵ äºİ
è° Ī
æī ¹
u res
è¯Ħ ä»·
çĽ® çļĦ
ç§° ä¸º
n ç»¼ä¸ĬæīĢè¿°
åŃĹ åħ¸
åĬĽ çļĦ
Ġsh ould
å±ŀ æĢ§
ä¸ĵ æ³¨
Ġ key
ä½į äºİ
Ģ æľī
è ²
o nt
èī² å½©
Ġsta rt
æıĲ åĪ°
ri x
s et
éĥ¨ éĹ¨
n è¿ĻäºĽ
è¯· ä½ł
åĨľ ä¸ļ
åº Ł
çī Ļ
åĵª ä¸ª
çļĦç Ł¥
ç¥ Ŀ
æļ ´
çĥ §
v alue
Ġvar i
åģ¥ èº«
åį ĥ
æŁ Ķ
co r
åıĸ å¾Ĺ
ç»ĵ æĿŁ
d d
in ce
ä½łåı¯ä»¥ ä½¿çĶ¨
æī® æ¼Ķ
åı¯ä»¥ æł¹æį®
æĮĩ æłĩ
éļ Ķ
åį³ åı¯
å°± ä¸ļ
å¹ ķ
Ġcre ate
al se
ä» ¿
æıĲä¾Ľ ä¸ĢäºĽ
çŃī äºİ
åı¤ ä»£
ç¥ŀç»ı ç½ĳç»ľ
åı¯ä»¥ æĺ¯
çļĦ åŁºæľ¬
é» ĺ
çŃī æĸ¹å¼ı
èĤ ª
èĦĤ èĤª
æ» ĳ
åĪĿ å§ĭ
çļĦçĥ Ń
ing s
æ¬ §
é¢Ĩ å¯¼
Ġs he
æľī ä¸Ģ
ä¸» ä¹ī
åĬ¨ åĬĽ
æĸĩç«łä¸Ń æıĲåıĸ
res ult
æĺ¯ çļĦ
è°¢ è°¢
å£° éŁ³
Ġi mp
ä»¥ä¸ĭåĩłä¸ª æĸ¹éĿ¢
li b
çĽ¸ ä¼¼
ve l
çĤ¹ åĩ»
ĠE x
ãĤ Ĵ
åĴĮ åħ¶ä»ĸ
Ġd i
åĴĮ æ²»çĸĹ
çļĦæŃ £
çļĦ åĨħå®¹
å®ļ ä½į
ç« ¥
åĩĨç¡® åľ°
çĤ İ
çļĦæĥħåĨµ ä¸ĭ
äºĭ æĥħ
åĴĮ ç®¡çĲĨ
çļĦ åŁºç¡Ģ
éĽ ª
in put
åĪĨ ä¸º
èŀį åĲĪ
æ± ģ
åĬ¨ ä½ľ
è¿Ľ åħ¥
åı¯èĥ½ æĺ¯
éŃ Ķ
å¯¹ æĸ¹
å² Ľ
ä¸į è¿ĩ
ç» ©
åĬ© æīĭ
1 4
åĽŀ æĶ¶
å¡ «
è§ī å¾Ĺ
Ġar r
éķ ľ
Ġwh at
è´ µ
ä½ĵ çİ°
E x
æĶ¶ åħ¥
åŁº åĽł
nåľ¨ è¿Ļä¸ª
æĥ ł
çļĦæĶ ¯
æİ¥ æĶ¶
é¢ĳ çİĩ
çĶŁæĢģ ç³»ç»Ł
Ġan sw
ä¿Ŀ è¯ģ
ä¿Ŀ éĻ©
çļĦç Ī
å° ģ
ĠĠĠĠ Ġ
èĩªåĬ¨ é©¾é©¶
n o
çĬ ¯
è¦ Ĩ
å² ģ
èĥ ģ
åĴĮ åºĶçĶ¨
Ġequ ation
æķ ĳ
¹ é¥
èĤĮ èĤī
å½¢ çĬ¶
èĥ ŀ
çļĦæ´» åĬ¨
¹é¥ ª
å¯¹ çİ¯å¢ĥ
è®² è¿°
åĩ Ģ
v al
Ġmo de
æĶ» åĩ»
s p
åĴĮ åĪĨæŀĲ
çļĦ å°ı
Ġbo th
å¨ģ èĥģ
èĳ ±
åĮºåĿĹ éĵ¾
ç¾İ åĳ³
ä»¥ä¸ĭ åĩł
ç§į æĹı
åįķ ä½į
lo t
co nd
èī¯ å¥½
oo gle
n è¿Ļä¸ª
æİ Ī
as k
ä½ł è®¤ä¸º
it ies
le r
çļĦæī Ģæľī
Ġd es
^ {
f ter
åı¥ è¯Ŀ
R O
çļĦæİ ¨
é¢ĺ çĽ®
Ġ3 0
ä»Ĭ å¤©
çļĦ æĿ¥è¯´
Ġb u
æ¶ ¦
è¯Ń åı¥
ĠA I
çķĮ éĿ¢
åľ° æĸ¹
ç´§ æĢ¥
äººå·¥æĻºèĥ½ çļĦ
åı¯ä»¥ çĶ¨äºİ
è£ħ é¥°
f ul
çĶŁ ç´ł
Java Script
ge st
åŃ¦ æł¡
Ġ' "
è° ·
åĿĩ åĮĢ
èĩ³ å°ĳ
Ġre l
è§Ħ å®ļ
æĸĩåĮĸ åĴĮ
ä¼ĺ åħĪ
è®© äºº
Ġo per
æ± ¤
Ġwh o
åĭ ķ
I t
A T
åı¯ä»¥ èĢĥèĻĳ
n å¸ĮæľĽ
éĢļ ä¿¡
Ġse ems
Ġco st
åı¯èĥ½ä¼ļ å¯¼èĩ´
åį Ī
Ġth rough
åĬł è½½
çļĦ åĢ¼
4 0
Ġp e
æĪĸ åħ¶ä»ĸ
åİŁ å§ĭ
çĶŁ åŃĺ
( \'
é£Ł æĿĲ
) .
åĮĸ åĴĮ
åĢ¼ å¾Ĺ
p en
Ġpro duct
é¡ ¶
åľ¨åĮ»çĸĹ é¢ĨåŁŁ
Ġ }
Ġ1 5
æĹ¥ æľ¬
Ġval ues
o k
æľ Ŀ
Ġ è¾ĵåĩº
c d
å¨ ±ä¹Ĳ
åĪ º
ç»Ĩ èĥŀ
çļĦæµ ·
åģ¥åº· çļĦ
æ·± è¿ľ
ı è§Ī
åľ¨ ä¸įåĲĮ
å®¶ äºº
å© ļ
ä¼ł è¾ĵ
çļĦæ² »
æłĩ çŃ¾
å¤ļæł· æĢ§
çĶŁæ´» æĸ¹å¼ı
ri b
ï¼ī ï¼ļ
Ġansw er
çļĦ åİĨåı²
çļĦ ä»£çłģ
éĢĤ çĶ¨äºİ
Ġm ultip
æĻºèĥ½ å®¶å±ħ
çļĦç ²
åıĳ éĢģ
ust om
åĪĨæŀĲ åĴĮ
çļĦçłĶ ç©¶
Ġf act
æĦŁ è°¢
çļĦæĥ ³
Ġcon si
éĿŀå¸¸ éĩįè¦ģçļĦ
éļı æĹ¶
ç¥ŀ ç§ĺ
çĭ¬ ç«ĭ
è½» æĿ¾
] ,
çļĦæŃ ¥
å¹´ è½»
Ġe ff
çļĦæł ĩ
è¿ ¹
å° ¾
b in
éĢĤå½ĵ çļĦ
ve lo
here fore
Ľ åĽ´
Ġpo sit
æĸ° é²ľ
um n
Ġa ct
iz e
ction s
çĶ¨æĪ· ä½ĵéªĮ
å® «
ç¤¾ä¼ļ çļĦ
èĻ «
è¿ Ŀ
ç³ ķ
å°ı æĺİ
è¡¨è¾¾ å¼ı
Ġwh ile
ł éģĵ
o st
æ·± åĪ»
ver t
Ġma ke
è ¹
çļĦæ¯ ı
ail s
çĤ º
éĢ ²
è¿ Ń
äº§çĶŁ äºĨ
çĶ³ è¯·
èĲ ¨
çĹĩ çĬ¶
çļĦç¬ ¬
çī¹ èī²
Ġt able
è¯· åĳĬè¯īæĪĳ
æķı æĦŁ
åŃ¦ ä¼ļ
å¤ı åŃ£
Ġre fer
sta nd
ä¸Ģ ç³»åĪĹ
å½¢ è±¡
åį³ ä½¿
ru ct
çĶ ļ
å± ı
æ°§ åĮĸ
Ġst ep
ç¡® è®¤
qu are
ä¾¿ åĪ©
åıĤ èĢĥ
åħ³éĶ® è¯į
ç¬¬ ä¸ī
åħ¬ æŃ£
å· ŀ
Ġ Ã
å¹¸ ç¦ı
Ġfollow ing
åıį æĺł
p ar
p i
çª Ĺ
é¢Ħ æľŁ
æģ ¶
èĤ ¥
æļ Ĺ
Ġl angu
åĵ ²
oh n
æĢģ åº¦
s er
èĥ ¡
M O
2 00
éľĢæ±Ĥ åĴĮ
è¿Ļæł· çļĦ
çļĦçŁ¥ è¯Ĩ
Ġp erson
é£ŀ è¡Į
ä¸Ģ èĪ¬
é¢ĨåŁŁ çļĦ
æĹ¶éĹ´ åĴĮ
åº Ĭ
æĪĲ å°±
ble m
b ash
çļĦæĬķ èµĦ
è´Ł è´£
8 0
åĽ¾ çīĩ
è®¤ è¯Ĩ
Ġ z
Ġty p
çļĦæ² ŁéĢļ
ar ch
åĨ Į
æĸ¹ ä¾¿
é© ±
äººå·¥æĻºèĥ½ åľ¨
n ä»¥ä¸Ĭ
åıĬ åħ¶
å®ŀéĻħ åºĶçĶ¨
æŃ£ å¸¸
ç®Ģ æ´ģ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
è¯· æıĲä¾Ľ
çĶļ èĩ³
ä¸į éĶĻ
ä¸ĵ å®¶
çĽ¸åºĶ çļĦ
ou d
åĲĳ éĩı
æ± ī
å³ °
æĹ¥ å¿Ĺ
Ġassi st
æĶ¿ æ²»
S T
C h
åĩ ī
åħ¬ åĽŃ
å® ł
Ġmode l
å°½ éĩı
è¯» èĢħ
åĩĨç¡® æĢ§
} $
æĵ ļ
å¯ ¸
æľĢ æĸ°
æĿ¥ èĩª
Ġt ak
é¥ Ń
Ġg ra
æĿĥ éĻĲ
å¤ª ç©º
å¹³ æĸ¹
å¸ĥ å±Ģ
éº ¦
åįı è®®
Ġi d
åľ¨ äºİ
Ġg re
` ,
çļĦæ³ķ å¾ĭ
w ork
è¿ĩ åİ»
Ġd at
çļĦç ©
Ġs a
d ict
Ġh our
æĪĲ åĪĨ
æłĩ é¢ĺ
um ent
çļĦ è¡Įä¸º
i el
ä¿Ŀ éļľ
res sion
çļĦ ä¸»é¢ĺ
å®£ ä¼ł
æµģ è¡Į
ro und
çİ¯å¢ĥ ä¸Ń
æ¯ Ľ
åŃ ¤
æĢ§ è´¨
ç¼ĸç¨ĭ è¯Ńè¨Ģ
å¿ ĺ
Ġre g
å¹ «
åı¦ ä¸Ģä¸ª
åĴĮ æĮĳæĪĺ
Ġpo s
ç»ı å¸¸
æį ķ
åĲĮ æł·
re ct
åĳ¨ æľŁ
Ġma in
çļĦç ĭ
çļĦæ ĳ
çĿ £
äºº çī©
çļ® èĤ¤
çļĦæ²» çĸĹ
Ġon ly
éĻ Ħ
Ġp r
ver age
è¿ ·
at ure
åĬł éĢŁ
i x
Ġs ystem
è¯ŃéŁ³ è¯ĨåĪ«
åĨį çĶŁ
æ¶Ī èĢĹ
èµĦ éĩĳ
Ġcont ain
å® Ĺ
ä¸ŃçļĦ åºĶçĶ¨
æ³ ³
åĴĮ å®īåħ¨
è¿Ļ ä¸įä»ħ
å¹« åĬ©
\\) ,
æĺ¯åĲ¦ æľī
çĽ¸ ä¿¡
è¶³å¤Ł çļĦ
ç»´ çĶŁç´ł
æ» ¤
äº Ī
çļĦä¸Ģ éĥ¨åĪĨ
çļĦ æĢ»
çļĦæı Ĳ
æĭ Į
f e
ĠP ro
æĶ¾ åħ¥
m in
æľīæīĢ ä¸įåĲĮ
æĸ¹éĿ¢ çļĦ
è¿Ĳ èĲ¥
æľª çŁ¥
Ġkn ow
åģ ¶
Ġn o
ä¸ĸ çºª
Ġs erv
c le
' t
è¦Ĩ çĽĸ
. "
æµ ıè§Ī
n æľĢåĲİ
Ġsi gn
åŃ¸ ç¿Ĵ
å¼Ģåıĳ èĢħ
çľŁ æŃ£
å®ł çī©
o ck
ä½ĵ ç³»
ind ow
è¡Į æĺŁ
Ġh er
è Ŀ
er ror
ä¿® å¤į
ç¾¤ ä½ĵ
çļĦ åħĥç´ł
b o
åħ· å¤ĩ
è§Ħ èĮĥ
å° į
æ° ¸
Ġl ine
ç´ ¯
ç²¾ ç¡®
è´ ´
in k
èģĬ å¤©
néĢļè¿ĩ ä¸Ĭè¿°
ical ly
åİ ļ
æĽ´å¥½åľ° çĲĨè§£
åŃĲ çļĦ
è¯į æ±ĩ
æĹłè®º æĺ¯
o g
n ing
é ŀ
è¢ ĭ
il d
åį ł
å¹ ħ
å±ŀ äºİ
çļĦæ° Ķ
Ġs er
Ġ åĩ½æķ°
çļĦæ¯ Ķ
çŁ© éĺµ
è±¡ å¾ģ
æĹ¶ ä»£
å¥ ¥
åľ° åĿĢ
èĮ Ħ
æĪ· å¤ĸ
e c
ä¸ī è§Ĵ
çŃī å¾ħ
çļĦ éĢīæĭ©
çļĦ å¥½
åıĹ æ¬¢è¿İ
ãģ Ĺ
è¯ģ æĺİ
åĢ º
ç§¯æŀģ çļĦ
lo y
çļĦæł ¸
Ġm u
i ent
å¤ĸ éĥ¨
çī¹åĪ« æĺ¯
åĪĹ åĩº
çļĦ çĽ®æłĩ
éļ¾ ä»¥
é ¹
ì Ŀ
åŃ¦ æľ¯
c ed
çļĦæ ±
Ġelement s
ĠJ ava
æĶ¾ åľ¨
Ġl ar
å¼ ĥ
æĺ¯ ä¸ŃåĽ½
åĳ¨ åĽ´
æĽ¿ æį¢
æĳ ĺ
æĦŁ åħ´è¶£
t ml
Ġpro blem
ç´¢ å¼ķ
éĺ »
è¿Ļ æĦıåĳ³çĿĢ
nI f
æķ°æį® åĴĮ
l ine
å®ļ åĪ¶
Ġt ry
å½¢ çļĦ
io us
æĦı å¤§åĪ©
ä¿Ŀ åŃĺ
qu ence
ãģ ¾
åĴĮ åıĳå±ķ
è¿Ń ä»£
æī °
å¤§ åŃ¦
al s
æ¸© æļĸ
ĠĠĠĠ ĠĠ
æŃĮ æĽ²
çĶµ è§Ĩ
åĴĮ çĲĨè§£
ä¸ĭ çļĦ
ç±» åĪ«
2 4
æĿ ĳ
1 3
res ent
ãĢĭ ãĢģ
åĴĮ å¯¹
ç§ĳåŃ¦ å®¶
åº¦ çļĦ
Ġh igh
Ġt est
Ġof ten
æīĭ æ®µ
åĲĪ åĲĮ
ert ain
é«ĺ è´¨éĩı
ä¸¥ æł¼
çº¿ æĢ§
è¡ ĵ
æ¯ı ä¸Ģ
çļĦæŃ¥ éª¤
ä½¿çĶ¨ çļĦ
åĨħ çļĦ
ow er
ol d
è½¬ åĮĸ
Ġ$ \\
åĪ© çĽĬ
æ¡Ī ä¾ĭ
çļĦç Ĺ
çī© ä½ĵ
ro up
ç¡¬ ä»¶
æĦŁ åıĹåĪ°
çļĦç¼ĸ ç¨ĭ
ä¸Ģ çĽ´
åĿļ æĮģ
è¶ħ è¿ĩ
ä¸Ģ åĲį
p ath
Ġp a
æĦ ī
Ġe mp
æ¬ £
i que
æľ ĥ
è§£ çŃĶ
äºĭ é¡¹
æĹ¶ å°ļ
ä¼ł éĢĴ
æĭ į
éĿŀå¸¸ éĩįè¦ģ
ï¼Ł '}]
æıĲä¾Ľ ä¸Ģä¸ª
çļĦæ¸ ©
so le
æĥ Ĭ
æ¿Ģ åĬ±
éĥ½ ä¼ļ
åĵ² åŃ¦
ä¹ ı
çĹħ æ¯Ĵ
ç ¶
è§£ æŀĲ
ot al
éĽĨ ä¸Ń
Ġ æŃ¥éª¤
as es
n W
è ķ
it le
Ġ ```
_ {
åĴĮ æķ°æį®
çĥ ¹é¥ª
åĴĮ ä¼ĺåĮĸ
ra me
ar s
åı¯ä»¥ ä¸º
vers e
èĥ½ åĲ¦
åıį æĢĿ
èħ Ĳ
ä¾ §
nè¯· æ³¨æĦı
æľŁ éĹ´
Ġle ngth
ä¸ ¦
åħ ¼
iel d
çļĦ åıĺåĮĸ
çłĶ åıĳ
æ°Ķ ä½ĵ
æĸĩ åŃĹ
èĢĮ æĺ¯
\\[ \
Ġc ase
æ¹ ĸ
åĦ¿ ç«¥
ess age
Ġen s
æķħ éļľ
næĢ» çļĦæĿ¥è¯´
åĲ« ä¹ī
åĨ ¬
âĢĿ ãĢĤ
ma il
ç¢ į
Ġst ate
ç»Ļ å®ļçļĦ
åĽłä¸º å®ĥ
é ł
æ´ ¾
åľ° çĤ¹
çļĦç© º
r ans
Ġb ased
åĪĹè¡¨ ä¸Ń
çļĦæĬĢ èĥ½
S ON
æıĲ ç¤º
le t
æķ° åĢ¼
çļĦæ ¶
éĢļå¸¸ éľĢè¦ģ
è¯¦ç»Ĩ çļĦ
ä¸ĭ éĻį
Ġe nd
å¿ĥçĲĨ åģ¥åº·
Ġ ë
ä½¿çĶ¨ Python
velo p
çķ ħ
é¥ ¼
Ġ ent
æķĻ å¸Ī
å°½ ç®¡
Ġco nd
HT ML
g s
ä¼ĺ æĥł
æĪĳä»¬ å°Ĩ
åĳ Ī
ä»¥ æıĲé«ĺ
ä» ª
ag es
and as
èª ī
è¯Ħ è®º
æķ° åĪĹ
è§Ħ å¾ĭ
Ġ\\( \\
å¼ ±
çļĦ èĥ½åĬĽ
åĴĮ å»ºè®®
æī¾ åĩº
Ġ å¦Ĥæŀľ
Ġs y
è¿ľ ç¨ĭ
å¢ Ļ
éĥ ģ
n N
çļĦæ¦Ĥ å¿µ
ç§į ç±»
v ing
åĶ ¯
å¿« ä¹Ĳ
é«ĺ çº§
éĵ¾ æİ¥
ãĢĭãĢģ ãĢĬ
T P
æĢ Ģ
I N
åº Ĩ
éĩį è§Ĩ
çļĦ ç»ĵæŀľ
ver y
__ __
MO SS
åľ¨ ä¸Ģä¸ª
m ing
Ġ %
è¿Ľ ç¨ĭ
çĽĳ ç®¡
çļĦç Ŀ
å®ŀ ä¾ĭ
at ter
Ġs k
èĩª ä¿¡
èĴ ľ
ç»´ æĮģ
ä½¿çĶ¨ äºĨ
re qu
æ³ Ħ
ãģ «
le ft
éĽĨ åĲĪ
è¿Ļ æ®µ
Ġra ndom
éŀ ĭ
ä¸Ń æľĢ
ç§ Ģ
å®ŀéĻħ ä¸Ĭ
è®¤ çŁ¥
çļĦæµ ģ
ar get
è¿ĺ éľĢè¦ģ
) ^
èĳĹåĲį çļĦ
si gn
Ġd irect
èĭ Ĺ
p ri
å® ģ
åį« çĶŁ
éĴ ±
ä¾ µ
ch o
èĽĭ ç³ķ
Ġapp ro
åŁºæľ¬ çļĦ
çīĽ å¥¶
çĶ ²
åĳ³ éģĵ
çĶµ æ±ł
æīĢ åľ¨
v ent
è¡¨ æ¼Ķ
çº¿ ç¨ĭ
éķ ĩ
éĢīæĭ© åĲĪéĢĤçļĦ
Ġ ç¤ºä¾ĭ
èĢĲ å¿ĥ
è®° ä½ı
ç´§ å¼ł
çļĦæ ĭ
Ġs m
ent ial
Ġor der
ç£ ģ
ç¬¬ ä¸Ģ
çļĦæł¸ å¿ĥ
æĪĲ æŀľ
èİ ī
æ¶ µ
æģ Ĳ
èĤ ´
å°¤åħ¶ æĺ¯
çļĦ åı¯
åıĺå¾Ĺ æĽ´åĬł
Ġsent ence
èĭ ı
æĦŁ è§ī
æĺ¯ çĶ±
èĬĤ å¥ı
Ġst r
çļĦç² ¾
å ĺ
æŃ »
4 5
ĠR e
æ¯ı æ¬¡
ç¢ º
nt h
Ġ2 5
åĪ ¸
æĸ Ĺ
en ces
am es
ç¨³å®ļ æĢ§
å¤± è´¥
ç¼ĸ çłģ
ç Ĵ
Ġres pon
æ ¦
éĿ¢ è¯ķ
v es
n er
å¼ķ åħ¥
çļĦæī ĭ
äºº æ°ĳ
çļĦç Ł
å½ ¼
çł´ åĿı
åī ²
èĪ ¹
åĨħ å¿ĥ
åīį æĻ¯
Ġd ay
å¡ Ķ
ç½ ª
è¿Ĳ ç®Ĺ
Ġp ass
v ol
ä¸įæĸŃ åıĳå±ķ
çļĦ å¤©æ°Ķ
ç¾İ å¥½
è ļ
åĿĩ è¡¡
æ¸ łéģĵ
è´¦ æĪ·
li f
Ġm ay
åľ¨ å¤ĦçĲĨ
é¡¾ å®¢
i an
t est
å·§ åħĭ
è´§ å¸ģ
æ¸¸ æ³³
Ġdet ails
æ¥ ¼
å¯¹ åºĶ
èĦ ±
ad d
Ġty pe
n B
æľī çļĦ
æ¼ ı
ä¿ĿæĬ¤ çİ¯å¢ĥ
l t
cd ot
çļĦæĶ¯ æĮģ
äºº å£«
è¡¨ æĺİ
' m
Ġunder stand
åĸľ å¥½
ä¹ ³
çļĦæĥ³ æ³ķ
å¼º å¤§çļĦ
çĽ® å½ķ
¹ æŀľ
d es
å¼ ¹
ma x
è¿Ľ å±ķ
ä¼¼ ä¹İ
å¤§ åŀĭ
çı į
éĢĲ æŃ¥
Ġinclud ing
Ġ X
\ ':
éĩĬ æĶ¾
ä¼ĺ çĤ¹
å£ ¤
çļĦæ Ľ
çļĦæİ Ĵ
æĦŁ åĴĮ
Ġle n
ä¸į è¶³
çĽĳ çĿ£
Ġconsi der
Ġmo st
ï¼Į âĢľ
) `
çĪ± å¥½
ur ing
èµĦ äº§
Ġw orld
o od
1 7
9 9
è¯» åıĸ
å¤ļ åħĥ
åħħ è¶³
çŃī åĽłç´ł
ä»İèĢĮ æıĲé«ĺ
iz ed
æľŁ æľĽ
Ġp lay
Ġob ject
çķ ª
in u
c ent
çĥ Ł
Ð »
op le
çļĦ çĶµå½±
åŁº éĩĳ
å¤ «
èĭ ¹æŀľ
åĩº æĿ¥
ä»¥ä¸ĭ æĺ¯ä¸Ģ
} \\)
Ġc a
Python ä¸Ń
çľŁ å®ŀ
éķ¿ æĹ¶éĹ´
åĮ»çĸĹ ä¿Ŀåģ¥
æĮĩ åįĹ
æĵ İ
åħĥç´ł çļĦ
å¤ļ çļĦ
g or
m er
f ic
o me
æıĲ éĨĴ
ma nd
Ġr un
æĹ¶ çļĦ
ãĤ ĭ
åľŁ å£¤
nf rom
çļĦæ ½
èĩª è¡Į
ç»Ħ ä»¶
éĶ ģ
ar ray
å¼ķ æĵİ
r ror
Ġle arn
åĴĮ èµĦæºĲ
äº§åĵģ çļĦ
åı¯èĥ½ æĢ§
Ġvari able
åı¯ åĨįçĶŁ
åľ¨ æľªæĿ¥
: //
åĪĨ è§£
éĽ ħ
éģ İ
å¤ªéĺ³ èĥ½
åĴĮ æĶ¯æĮģ
ĠY ou
ab ility
æµª è´¹
ç»ı è¿ĩ
il y
ç ·
çļĦ ä¸Ģä¸ª
æĽ´ å®¹æĺĵ
ï¼Ľ \
ä¸ªäºº çļĦ
ä¼ Ļ
m it
çļĦæı ı
çļĦæĻº èĥ½
æĸĩ æĺİ
ç®Ģ åĮĸ
å¥ĸ åĬ±
è¯ º
çĶŁæĪĲ ä¸Ģé¦ĸ
ä¸Ĭ æľĢ
æľŁ å¾ħ
o id
æĻºèĥ½ åĮĸ
çļĦçĿ ¡çľł
d i
åĪ ļ
ä½ľ èĢħ
éĩįè¦ģ çļĦæĺ¯
ith m
nS o
æµ ®
St ring
è§Ĩ ä¸º
æīĭ æľ¯
Ġev en
åĵģ è´¨
Ġ Q
ä¸¤ ç§į
æĭ ¼
èģĮ ä½į
è¯· ç»ĻæĪĳ
çļĦ é£Łçī©
èĬĤ æĹ¥
ç¾İ å¥½çļĦ
è°ĥ æŁ¥
ä¸įä»ħ ä»ħ
çŃī å¤ļä¸ª
å¹¶ æıĲä¾Ľ
ä»¤ äºº
ç¼º ä¹ı
åħį çĸ«
n con
Ġam ount
è¿ ħ
Ġcor rect
Ġin sta
í ķ
è´ŁéĿ¢ å½±åĵį
ç¬¦ åı·
å½± åĥı
Ġst d
h tt
çĵ ¶
åĪĨ åŃĲ
Ġ ä¸Ń
u g
R L
èıľ èĤ´
å¿ ½
æĢ» æĺ¯
çļĦæ¸ ¸
åĲ« æľī
é¸¡ èĽĭ
æ¯ıä¸ªäºº éĥ½
Ġst ud
æĽ¿ ä»£
æ ª
Ġha nd
Ġper form
åĩĨç¡® çļĦ
éļľ ç¢į
å°½ åı¯èĥ½
çĶ¨æĪ· çļĦ
P U
ç²¾ åĩĨ
åį ĸ
ä¸į ç¡®å®ļ
é ½
çļĦæĮĩ å¯¼
æİ¥ è§¦
çľĭ èµ·æĿ¥
æĿĥ åĪ©
P ro
Ġre ad
ä» °
ä¸ª ä½ĵ
Ġ< <
èĩª ä¸»
å±Ĥ æ¬¡
å¿ĥ æĢģ
åħĭ æľį
è´¨éĩı åĴĮ
è¿Ĳ çĶ¨
æ© Ł
Ġt ri
Ġp ublic
å¤§ å®¶
W eb
v en
N A
ä¸įä»ħ èĥ½å¤Ł
èĢ ³
åı¯ä»¥ éĢīæĭ©
é¸ £
å¤§ çº¦
b r
p rint
åľ¨ ä¸Ģèµ·
æŀĦ æĪĲ
æģ Ĵ
et s
Ġlangu age
ç§ĳ å¹»
èĩª èº«
å®¤ åĨħ
å®¹ åĻ¨
Ġcon st
ç«ĭ åį³
åĴĮ ä½¿çĶ¨
çļĦçĪ ±
Ġword s
Ġp lease
éĿ¢ çļĦ
e k
al le
ãģ ¯
æŀ¶ æŀĦ
ç¿»è¯ĳ æĪĲ
èĥ½åĬĽ åĴĮ
é£Ł çĶ¨
åģ¥åº· é¥®é£Ł
æĭ Ľ
Ġ5 0
ä½¿ åħ¶
Ġcomm on
éº »
çĽ® çļĦåľ°
$ ,
A B
éĿ¢ ä¸Ĭ
Ġb re
èľ ľ
ç§ Ł
åİ ĺ
äº§ ä¸ļ
Ġout put
sq l
ode l
åı¯ä»¥ åĩıå°ĳ
Ġte ch
é¢Ħ æĬ¥
éĿ¢ åĮħ
é¢ Ĺ
åĢ Ł
å¿ ł
çļĦç ¥
å®¡ æŁ¥
çļĦæ½ ľ
èĴ ¸
al y
å®ŀ ä½ĵ
re n
S E
en cy
ç»ĵ è®º
æľī è®¸å¤ļ
à ¹
åħħæ»¡ äºĨ
ä¹ĭéĹ´çļĦ åħ³ç³»
ä»¥ä¸ĭ æŃ¥éª¤
å¯ ¿
æŁĲ ç§į
åľ¨ ä½¿çĶ¨
èº« å¿ĥ
çļĦç Ĭ
æįŁ å¤±
é©± åĬ¨
Ġ" "
ãĥ ¼
æĽ´å¥½åľ° äºĨè§£
âĢĿ ãĢĤ\
t ime
å¤§ åľ°
éĢĴ å½Ĵ
è°ĥ èĬĤ
å·§åħĭ åĬĽ
è°ĥ åĳ³
Ġd ig
: ",
ut es
çº ¤
æĦŁ åĻ¨
å§ ¿
å¤įæĿĤ åº¦
å¤§ èĩªçĦ¶
æıĲä¾Ľ çļĦ
å®īåħ¨ åĴĮ
t a
æĮĩ å®ļ
Ġ &
in s
æĻ¯ çĤ¹
á º
h tml
çļĦ åĲĮæĹ¶
åĲĪ æ³ķ
å®Ĺ æķĻ
on s
ç¡®ä¿Ŀ æīĢæľī
æ¬£ èµı
c s
åĴĮ æľįåĬ¡
çŃī æĬĢæľ¯
åħ Ń
æ ¾
æ± Ł
åĵª ç§į
æł· çļĦ
å¤§ æ°Ķ
è¿Ĳ è¾ĵ
æĽ´ é«ĺæķĪ
ä¾ĭåŃĲ ä¸Ń
æľ¬ ä¹¦
è¿Ļ æĺ¯ä¸Ģ
ä¾¿ æį·
åĨĴ éĻ©
çİ¯å¢ĥ æ±¡æŁĵ
èı Į
od y
çĪ ¶
åĪº æ¿Ģ
çļĦ æľºä¼ļ
ç» ķ
t he
å±ı å¹ķ
å¾Ĺ åĪ°äºĨ
åķ ı
ur al
æĲ ħ
Ġ ve
ä¸Ģ åıª
Ġs ame
ä¸ĵä¸ļ çļĦ
ç¾İ åħĥ
Ġse cond
å¹´ çļĦ
è¿ŀ ç»Ń
Ġw ay
Ġv er
è¹ Ī
Ġ right
åį± éĻ©
éª ¨
Ġle ft
é« Ķ
æ¶Ī æģ¯
Ġ1 6
ï¼ģ '}]
å·¨ å¤§
çķª èĮĦ
æł¸ å¿ĥ
éŃĶ æ³ķ
ä¼ł æĦŁåĻ¨
ç³»ç»Ł ä¸Ń
æĥħ èĬĤ
åı¯èĥ½ æľī
Ġde velop
pp ort
ãģ Į
it ial
éª ĳ
æķ¸ æĵļ
Ġh ere
æķĻèĤ² åĴĮ
Ġn p
ä¸º æĪĳ
p lot
å¤ĩ ä»½
æıĲ åīį
èĪŀ è¹Ī
av as
èĢĥèĻĳ åĪ°
ĠC l
åĩº äºĨ
è´ Ŀ
æĪĳ å¾Ī
èĻļæĭŁ çİ°å®ŀ
çı ¾
è¯ģ æį®
n åħ¶æ¬¡
åı¯ä»¥ å°Ĩ
æľ¬ èº«
æī ĺ
cl ass
ul a
åĶ¯ ä¸Ģ
å®ĥä»¬ åľ¨
æľīè¶£ çļĦ
er n
numb er
p lay
Ġor ig
åıĮ æĸ¹
ä»¥ åħ¶
èĦ ı
at ch
å¼ķ åıĳ
éĩĳ é¢Ŀ
æľĢ é«ĺ
èģ ĺ
ot e
åĽ¾ å½¢
avas cript
ul l
åħ¼ å®¹
èĮĥåĽ´ åĨħ
åĽŀ å½Ĵ
è· ĥ
åıª æĺ¯
æľ Ĺ
æĸ ¼
åĽ¢éĺŁ åĲĪä½ľ
åģı è§ģ
Ġcomple x
å¿ Ļ
èħ ¿
éĹ ª
è´ ·
æĲħ æĭĮ
æĪĳ ä¸ºæĤ¨
Ġs quare
ac he
åĶ ±
A r
åĲ¯ åĬ¨
çļĦæ¶ Ī
Ġb ack
å Ĺ
ä¼Ļ ä¼´
i ed
åī ¯
è·Ł è¸ª
åĲĪ è§Ħ
Ġlo g
èĢĥ è¯ķ
Ġsi mple
ct or
G oogle
l it
ä½ł ä»¬
im al
è¿Ļ åĮħæĭ¬
ç§ Ĵ
çŃī éĹ®é¢ĺ
å¦ Ļ
Ġo pt
ä¼łç»Ł çļĦ
Ġ :
ation al
an y
w are
åĴĮ éľĢæ±Ĥ
é¡ Į
ãģ §
çī© çļĦ
Ø §
or m
nT o
æľĢ å¥½
çļĦæ ĵ
æĦŁ æŁĵ
æľĢ æĸ°çļĦ
åı ī
è¿Ľè¡Į è°ĥæķ´
ĠW e
ãĢĤ "}]
at ic
ç² Ĵ
å·² çŁ¥
ang le
æĹł äºº
é»ĳ æ´ŀ
ĠC on
ĠA PI
åĪĿå§ĭ åĮĸ
æĪĳ è®¤ä¸º
å¹¶ å°Ĩ
ç¡®ä¿Ŀ åľ¨
æıĴ åħ¥
å®ŀéĻħåºĶçĶ¨ ä¸Ń
äºº çĶŁ
è¿Ļ ä¸¤ä¸ª
æľī æ²¡æľī
æ°Ķ æ¸©
Ġrequ ire
ä¸ĵæ³¨ äºİ
ä¸Ģ æ¬¾
nT herefore
å¯¹ äººç±»
åŃĹ æ®µ
ä¹Ł æľī
åħī çº¿
åĩº è¡Į
j avascript
å°º å¯¸
çļĦ éŁ³ä¹Ĳ
ãģ Ħ
æ¡ Į
çļĦæ¨¡ åŀĭ
Ġreturn s
Ġtak es
Ġwe b
åĴĮ æĬĢæľ¯
ä¸ĭéĿ¢ æĺ¯ä¸Ģä¸ª
b e
åī ª
Ġal low
2 3
loy e
in ed
çļĦæ ¬
Ġbe en
Ġpe ople
ä¸ĭ è½½
æľ µ
æıĲé«ĺ äºĨ
Ġpart ic
åı¯åĨįçĶŁ èĥ½æºĲ
çİ ī
re am
çĿ ¡
éĴ ®
ä¿¡ çĶ¨
åīį å¾Ģ
å±ħ æ°ĳ
p re
åı¯èĥ½ åľ¨
Ġ è®¡ç®Ĺ
æķ°æį® è¿Ľè¡Į
si ve
éĩį éĩı
è®º æĸĩ
åıĺ æļĸ
æİĴ åĪĹ
ä¹ ¡
Ġa g
çĶµ è¯Ŀ
E rror
Ġa fter
ä¸ ģ
an a
æ£ Ĵ
è¿Ļ é¦ĸ
åī ©
åįļ çī©
ãģ ª
é¢ĨåŁŁ ä¸Ń
çĤ ¸
é¡ ¿
æĿ¥ è®¡ç®Ĺ
æĹł éĻĲ
ç»ĵæŀĦ åĴĮ
åĭĩ æ°Ķ
çļĦ æķ°éĩı
èıľ åįķ
çĸ« èĭĹ
åı¯ä»¥ ä»İ
æĭ ¿
n æŃ¤å¤ĸ
çĶµåŃĲ éĤ®ä»¶
åĳĪ çİ°
æĩ ī
Ġfe el
J ohn
o f
æĥ³ æ³ķ
Ġex per
å¤§ æķ°æį®
ä¸Ģ å®ļçļĦ
lo ck
å®¢ æľį
æİ¥ åı£
çļĦæıı è¿°
n a
æĺŁ çĲĥ
ä¸į éľĢè¦ģ
åħ³ éĹŃ
ç¼ ĺ
æĪĳä»¬åı¯ä»¥ ä½¿çĶ¨
çº¢ èī²
æĪĳæĥ³ çŁ¥éģĵ
ç½ĳ é¡µ
5 00
å¥¹ çļĦ
åĬ¨ çĶ»
å¤© ç©º
è½» è½»
indow s
ç ĺ
èĢģ å¸Ī
èį £
å½¼ æŃ¤
åĩĨç¡® æĢ§åĴĮ
å·¦ åı³
çļĦ åĬŁèĥ½
è³ ĩ
çĶ¨ æĢ§
l ish
n çĦ¶èĢĮ
çī© æµģ
é¥® æĸĻ
R E
ä½ĵ éĩį
å¤§ è§Ħæ¨¡
å¾Ī å¥½
Ġf il
çĸ ²
çļĦ ä½įç½®
åĮº åĪ«
éĴ ¥
æĪ¿ éĹ´
çļĦæĵ įä½ľ
æıĲ äº¤
çĻ Į
] )\
è¾ĥ ä½İ
å¹¿æ³Ľ çļĦåºĶçĶ¨
r ic
çļĦæĶ ¶
l an
é¢Ħ å¤ĦçĲĨ
n éļıçĿĢ
åı¤ èĢģ
Ġro w
ath er
Ġv i
åŃ¤ çĭ¬
çļĦ æĸĩåĮĸ
çļĦ äº§åĵģ
å¯¹ æīĭ
åĪ° è¾¾
è¿ĩ æ»¤
å¼º åº¦
çŁ ¿
åįı è°ĥ
O S
çŃ Ľ
Ġ+ =
å±ķç¤º äºĨ
.. .
n å¦Ĥæŀľ
d a
ç»Ļ ä½ł
ĠS QL
çĿ Ľ
æ¬¡ æķ°
çļĦæİ ªæĸ½
ï¼Į "
åĮħ å®¹
tra ct
ä¸ĢäºĽ åħ³äºİ
çļĦ åİŁåĽł
çº¤ ç»´
åľ¨æŁĲäºĽ æĥħåĨµä¸ĭ
éļĲç§ģ ä¿ĿæĬ¤
t ing
y n
ä¸º ä½ł
Ġdet erm
LE CT
M y
éĿŀå¸¸ æľī
è¿ħ éĢŁ
Ġ æķ°æį®
åľ° ä½į
æĺ¯ å¦Ĥä½ķ
è¾ĥ é«ĺ
Â °
æ¢ ¯
Ġpos sible
Ġme ans
æµıè§Ī åĻ¨
åĲİ ç»Ń
le ngth
æ¸ħ æ´Ĺ
ä¼ĺ ç§Ģ
ç¼ĸåĨĻ ä¸Ģä¸ª
Ġhour s
al ity
èµĦæºĲ çļĦ
å¹³åĿĩ åĢ¼
åľº åĲĪ
æĽ´ å¿«
D ata
ç¨ ®
-- -
åĴĮ ä¸į
å·¥ èīº
éĸ ĵ
åĮħåĲ« äºĨ
åı¯ä»¥ å°Ŀè¯ķ
Ġwith out
ãģ¾ ãģĻ
åŃ¦ èĢħ
å£ ®
å¤ı æĹ¥
æ¢¦ æĥ³
å® ľ
ç§ĳæĬĢ çļĦ
ä¿¡æģ¯ çļĦ
Ġme an
åĨį æ¬¡
éģĵ è·¯
æĽ ¾
æ¯Ķ ä¾ĭ
o mp
âĢĶ âĢĶ
èĬĤ èĥ½
ä¸İ åħ¶ä»ĸ
èĬĤ çº¦
çļĦæĥħ ç»ª
Ã ¡
å»ºè®® æĤ¨
Ġimport ant
Ġre f
ä¹Ł åı¯èĥ½
Ġcomp ut
äº¤ æį¢
çļĦçģ µ
Ġare a
Ġ æĪĸ
èĤ º
è®© ä½ł
çļĦæŃ Į
ä»¥åıĬ å¯¹
ç®¡çĲĨ åĴĮ
åı¯ä»¥ è¢«
æ·± åĳ¼åĲ¸
éľĢè¦ģ åľ¨
æ·±è¿ľ çļĦå½±åĵį
ä¼¤ å®³
9 0
Ġth ree
è®¾è®¡ ä¸Ģä¸ª
Ġs cript
RO M
Ġquest ion
åĻ ª
ä¸Ģ æł·
çļĦ ä¸»
æĬ ±
æ³¨ åĨĮ
Ġinteg er
Ġrequ est
ä»¥ éĢĤåºĶ
çļĦ éķ¿åº¦
Ġ error
åĴĮ åŃ¦ä¹ł
å¼ķ çĶ¨
æĸ¹æ³ķ æĿ¥
æĳĺ è¦ģ
g re
æĮī éĴ®
éĢīæĭ© ä¸Ģä¸ª
im um
åĲ¸ æĶ¶
è·¯ çº¿
è®¾è®¡ åĴĮ
äºĶ ä¸ª
æľįåĬ¡ çļĦ
çģ¾ å®³
è¯ĬæĸŃ åĴĮæ²»çĸĹ
çĬ ¬
è¡ Ĺ
ra ndom
å¿ĥ çģµ
ä»¿ ä½Ľ
Ñ ĥ
æľ¬ åľ°
è¯¢ éĹ®
ra ct
ä½ĵ èĤ²
æĤ ¦
æµĭ éĩı
æĲ º
: **\
Ġpro per
çļĦçĬ ¶
å¼ķ å¯¼
æķ ¢
å· Ŀ
ãģ ¨
å®ģ éĿĻ
çļĦæĶ ¿
Ġform ula
m on
çļĦæĻ ¯
Ġincl ude
åŀĥåľ¾ åĪĨç±»
ä¸Ĭ æµ·
åı¯ä»¥å¸®åĬ© æĪĳä»¬
æľī éĻĲ
ä¸Ģ å¤©
ä½ľä¸º ä¸Ģä¸ª
èį ·
è´ ¸
ex ample
æĪĳ åľ¨
ä»Ģä¹Ī æĺ¯
çļĦæ Ł
éĻ Ī
æ³¨æĦı åĬĽ
çķ ¶
åĢ į
å¡ ŀ
æ° ı
n C
t on
æµģ éĩı
---- ----
Ġc ustom
id th
ä¸Ń ä½¿çĶ¨
n ess
ç¤¼ çī©
æĥ³ è±¡
Ġar t
j o
åı¯ è§Ĩ
ä¹Ł èĥ½
al th
ä¼łç»Ł æĸĩåĮĸ
() ;\
åħĪ è¿Ľ
è¿Ľ åĪ¶
æĳ ©
Ġcharact er
åĩ Ŀ
ç½ ļ
å° ¿
Ġapp lic
ç«ŀäºī åĬĽ
è¿ĻäºĽ ä¿¡æģ¯
èº«ä½ĵ åģ¥åº·
åľ¨ Pythonä¸Ń
éĢļ çŁ¥
W hat
low er
Ġvar ious
åĶ Ĳ
S V
çļĦæ ¡
æľºåĻ¨åŃ¦ä¹ł ç®Ĺæ³ķ
æĺ¯ å¤ļå°ĳ
æĬĢ è¡ĵ
éĩį çĤ¹
æĴ °
åĪ¶ åº¦
2 1
ë ĭ
æĶ¶ çĽĬ
in dex
å¤§ èĦĳ
åľ £
åİ ¨
çº ½
åĪĩ æĪĲ
Ġyear s
éĽ ·
è®¤ è¯ģ
åł Ĥ
æĹ¶ åħī
æ³ķå¾ĭ æ³ķè§Ħ
åĴĮ æĹ¶éĹ´
éľ ĩ
ä½ĵ ç§¯
æ»¡æĦı åº¦
Ġg u
ç»ĦæĪĲ éĥ¨åĪĨ
æĽ´ åĩĨç¡®åľ°
Ġcon vert
ĠH e
` ï¼ļ
ä» Ķ
èĵĿ èī²
äºº åı£
p ort
å½ĵ ä½ł
æĬ ĳ
ä½ĵçİ° äºĨ
ition al
ca use
s ort
åħ¬ éĩĮ
åĸľæ¬¢ çļĦ
I P
G iven
nH ere
æķ°åŃĹ åĮĸ
çı ł
s ing
è° ľ
n ew
o se
Ġcharact ers
é¢Ŀå¤ĸ çļĦ
æĪĳä»¬çļĦ çĶŁæ´»
Ġinsta ll
å¹¶ åıĳ
æİ¨ çĲĨ
çļĦ è¯¦ç»Ĩ
è¿Ļ åı¥è¯Ŀ
èĦ ¸
éľĢè¦ģæ³¨æĦı çļĦæĺ¯
æ¥ Ń
ç¼ĵ åŃĺ
p art
çļĦæ £
n L
èĦ ī
ä»İ æĸĩç«łä¸ŃæıĲåıĸ
äºĭ å®ŀ
å¤ļ æķ°
à ¤
A P
Ġsol ve
ç¢ İ
çļĦ ç¤¾ä¼ļ
Ġle ad
C l
th ing
é» İ
è¿ĩ äºİ
å¼º å¤§
Ġm em
Ġm ed
N T
Ġprovid ed
n ä¸ºäºĨ
æľī ä»»ä½ķ
åĲĪ å¹¶
æĽ´ ä¸º
å± ĭ
' )\
1 000
çļĦ ä¸ĢäºĽ
} \\]\
æĹ¥å¸¸ çĶŁæ´»ä¸Ń
å¿ł è¯ļ
Ġin cre
çļĦçĶŁæ´» æĸ¹å¼ı
çļĦæĶ ¹
Ġ"" "\
æĵįä½ľ ç³»ç»Ł
Ġ â
éħĴ åºĹ
çļĦæ ¼
æ· ¡
Ġl ong
åįļçī© é¦Ĩ
ä¸Ģä¸ª äºº
çļĦ èĩªçĦ¶
åı¦ ä¸Ģ
è¾ĵåħ¥ çļĦ
åħ¨çĲĥ åıĺæļĸ
æĪĺ çķ¥
Ġf ound
åĲĪ çī©
Ġsign ific
è° Ĭ
æĽ´ æľīæķĪåľ°
sion s
çļĦæ¸ ħ
æĪĳä»¬ é¦ĸåħĪ
äºº éĻħ
çļĦç ĸ
çĸ« æĥħ
è§Ĩ è§Ĵ
Ġs c
Ġexp ression
åĴĮ æĥħæĦŁ
Ġto day
æ² ¿
b el
éĩİ çĶŁ
å ´
Ġde sign
Ġin vol
çĶŁæ´» çļĦ
çĭĹ çĭĹ
] [
I nt
è´¸ æĺĵ
çŁ¥ åĲį
åıĸ ä»£
Ġ content
åİ» éĻ¤
Ñ ĭ
æŀģ ç«¯
che s
çļĦæ¸¸ æĪı
ict ion
( \\
æĬķèµĦ èĢħ
éĢ² è¡Į
Ġd ist
l ice
éĩĳ å±ŀ
ä½ł å¯¹
éĢļå¸¸ åľ¨
å®ļä¹ī äºĨä¸Ģä¸ª
åĩº çļĦ
çĲĨ å¿µ
æĺ¯ éĿŀå¸¸éĩįè¦ģçļĦ
\\) ï¼Į
åıĺ éĿ©
æĿĥ çĽĬ
éĺ Ķ
åĸ Ŀ
ç»Ļ äºĪ
co de
Ġc le
éĢĶ å¾Ħ
èĸ Ħ
he ad
éĢīæĭ© éĢĤåĲĪ
æĿ °
ä¹ĭ å¤ĸ
E T
ä»¥ä¸ĭæĺ¯ä¸ĢäºĽ å»ºè®®
å§ Ĩ
å¤įæĿĤ æĢ§
çĽ Ľ
ä¹Ĳ è¶£
Ġ1 1
{ \\
Ġcon f
Ð° Ð
v ed
ä¹Ł éľĢè¦ģ
åŃ¦ä¹ł æĸ°
Ġa verage
et ers
èĳ ¡
æĪĲ ç»©
Ġ1 9
èĩªè¡Į è½¦
ä¿¡ ä»°
ç¾İ çļĦ
æĽ´ æĶ¹
å¯Į åĲ«
çĨ Ĭ
L ist
Ġterm s
å «
if t
vi ron
æĬ «
åŃ¦ ç§ĳ
Ġposit ive
çĶ¨ éĢĶ
èĲ Ħ
Ġun ique
Ġpri me
èĳ¡ èĲĦ
èª ŀ
å¤į åĪ¶
å¦Ĥä½ķ ä½¿çĶ¨
word s
Ġe very
å¯ Ĵ
å§ ĵ
èıľ åĵģ
at s
i er
Ġa v
æĬķ åħ¥
ä»¥ åĩıå°ĳ
åĿ Ľ
åıĹ ä¼Ĺ
ĠW orld
Ã ³
é¸¡ èĤī
åĴĮ ç»´æĬ¤
Ġ\\ ,
g y
æĺ¯ éĢļè¿ĩ
åĵª éĩĮ
ä¼ ¸
è° ģ
éĹ ²
åĪ© æ¶¦
æĭ ĵ
ere st
å¯¼ åħ¥
u th
éŃ ħ
iz ation
åıĭ è°Ĭ
ãĢĤ "
mat rix
I T
æĤ ł
ĠP lease
æĬĢæľ¯ çļĦåıĳå±ķ
ç¦ ģ
éģĩ åĪ°äºĨ
ä¸Ģ ç»Ħ
ç§ĳ æĻ®
æ³ °
ç¬¬ ä¸Ģä¸ª
çļĦ åħ³ç³»
æĤ ī
çī© èģĶç½ĳ
n O
æ³Ħ éľ²
äºĭ çī©
Y ou
ma ge
é¢ĨåŁŁ çļĦåºĶçĶ¨
è½¬åĮĸ ä¸º
} \\
éĺ ´
æł¹æį® èĩªå·±çļĦ
Ġkn own
Ġ1 8
çĶŁæĪĲ çļĦ
cul ate
åħ³ èģĶ
Ġt ake
Ġexper i
è¯Ħ åĪĨ
Ġro ot
y our
Ġla st
åĵ ¥
æĪĸ ä¸į
si ze
çļĦ æĢ§èĥ½
çŃī ä¿¡æģ¯
éĩĩåıĸ æİªæĸ½
çīĩ æ®µ
èīºæľ¯ å®¶
æĦ¿ æĦı
çļĦæĳ Ħ
ap pend
è½ ´
Ġd ays
è¿Ļæł· åı¯ä»¥
Ġrep resent
åı¯è§Ĩ åĮĸ
Ġm essage
çº ¯
Ġbre ak
ce l
æī £
ä¸Ģ åĢĭ
è¨ Ī
åįĩ çº§
è®¢ åįķ
æľĢ éĢĤåĲĪ
åĲĮ äºĭ
åĵģ ç§į
çģµ æĦŁ
æŃ ¦
æķĻ ç¨ĭ
Ġf ield
çº ¹
å®Į åĸĦ
çĵ ľ
h ip
ä¼ł è¾¾
çļĦ å¸®åĬ©
å¤§ å¤ļæķ°
å¤§ äºİ
ĠCl oud
ç´§ å¯Ĩ
et er
lo ad
åİĺ ç±³
éĹ ľ
ä¹ĭ åĲİ
çİ¯ä¿Ŀ æĦıè¯Ĩ
Ġpoint s
è «
çļĦ æľįåĬ¡
Ġa ge
et work
åĴĮ çĽ®æłĩ
Ġens ure
è¿ Ł
) $
æľīæīĢ å¸®åĬ©
èľ Ĥ
2 2
co re
éĤ Ģ
éģĹ ä¼ł
åºĶè¯¥ æĺ¯
æĪĳ åĢĳ
3 3
7 5
ro l
æ¬§ æ´²
ç´ «
é¼ ł
g er
éĩį å¤§
æ³¢ åĬ¨
w ard
èµ ĭ
Ġs orted
æľ¯ è¯Ń
å°¤åħ¶ æĺ¯åľ¨
åĢĴ åħ¥
åı¯ä»¥å¸®åĬ© åĮ»çĶŁ
ä¿ Ĺ
li ght
æĬĢæľ¯ åĴĮ
æ¶µ çĽĸ
çļĦ è¿ĩç¨ĭä¸Ń
åĽ¾åĥı è¯ĨåĪ«
å¼ºè°ĥ äºĨ
ä½ł æĥ³è¦ģ
çĪ Ĩ
èģĮä¸ļ åıĳå±ķ
çļĦæĻ ®
è¿ ģ
æī «
çļĦæĦı ä¹ī
çİ¯ä¿Ŀ çļĦ
å¯¼ èĪª
gor ithm
èµ ŀ
çī© ç§į
çļĦæİ ¢
ac ci
åķĨ åĬ¡
çĻ» å½ķ
Ġst ruct
ä¸ĵ éĹ¨
æ£ ĭ
éĽ Ħ
çļĦ ä»»åĬ¡
Ġmu ch
æĹ¶ åĪ»
è½ ¨
w w
æµ· æ»©
co s
` .
", \
ãģ Ł
æĢİ æł·
ä¿Ŀ çķĻ
iv es
åľ° çĲĨ
çļĦ çĶ¨æĪ·
æİ ī
å¼º çĥĪ
åºĨ ç¥Ŀ
ä¸ĭéĿ¢ æĺ¯
åħ «
éĴ ¢
å¹¿æ³Ľ åºĶçĶ¨
åĮ Ļ
æĪĺ äºī
å¸ Ŀ
Ġpo p
ä¾ĽåºĶ éĵ¾
Ġorig inal
ä½ĵ çİ°åľ¨
I M
S ure
ib on
lo at
js on
çĽ´ è§Ĥ
æķ ¬
Ġbe cause
èĸ ª
ibon acci
a h
åıįæĺł äºĨ
åľ¨ è¿ĻéĩĮ
å¼º åĮĸ
çļĦçĬ¶ æĢģ
f ind
åı¯èĥ½ åĮħæĭ¬
æ¦Ĥ çİĩ
æİ ĺ
åĴĮ å·¥ä½ľ
ç¨ į
èµĦ æĸĻ
äººå·¥æĻºèĥ½ çļĦåıĳå±ķ
åŃ¦çĶŁ çļĦ
æıĲåĪ° çļĦ
Ġid ent
ç¡®ä¿Ŀ ä½ł
çĶ °
éĺ¿ éĩĮ
çº ł
åĭĩ æķ¢
äººä»¬ çļĦ
å§ ľ
Ġj ust
è·ĳ æŃ¥
` ãĢĤ\
Ġp ot
çĻ ¼
Ġqu ery
Ġcol umn
Ġ1 3
æĿİ æĺİ
Ġte mp
g an
åĴ ª
: '},
è¿ĻäºĽ éĹ®é¢ĺ
åĪĨ æķ°
è§£éĩĬ ä¸Ģä¸ĭ
Ġre al
çļĦæĦŁ åıĹ
Ġis s
ç»¼åĲĪ èĢĥèĻĳ
Ġgener ate
Ġto p
å·¨ å¤§çļĦ
Ġin f
è¿Ļ éĢļå¸¸
çļĦæ ģ
åºĵ åŃĺ
çİ¯å¢ĥ çļĦ
å¤ľ æĻļ
n å¦Ĥæŀľä½ł
Ġc ap
it al
æ°´ åĪĨ
Ġmo nth
å®īåħ¨ çļĦ
æª ¬
æľī ä¸ĢäºĽ
æ³¨æĦı äºĭé¡¹
åŃ©åŃĲ ä»¬
æµ ¸
å½ĵåľ° çļĦ
çļĦ åĨ³çŃĸ
m ary
åĲ¬ èµ·æĿ¥
åı¯éĿł æĢ§
our ce
ãĢĭ ï¼Ī
in ess
ç¼º çĤ¹
çļĦç¥ ŀ
C D
æķ°æį® å¤ĦçĲĨ
å¸¦æĿ¥ çļĦ
æĹ §
åĬŀ åħ¬
Ġ .
Ġbe ing
çļĦæ ¢
æ½ ®
æĪ ´
åĴĮ åĪĽæĸ°
æľº éģĩ
çİ° æľī
å®¶ åħ·
åĨĻä¸Ģç¯ĩåħ³äºİ äººå·¥æĻºèĥ½
inu x
æĹĭ è½¬
si s
a ve
ä¼ļ å¯¼èĩ´
Ġc ar
æľį è£ħ
åł Ĩ
è ¼
å¹¶ è¿ĶåĽŀ
åł ¡
çļĦçĭ ¬
å¿ §
Ġac cess
Ġh um
é¢ĳ ç¹ģ
è² Į
çĶ· æĢ§
æĸ ľ
åı¯èĥ½ å¯¹
æ° ĽåĽ´
åĪĿ åŃ¦èĢħ
æıĲä¾Ľ ä¸ªæĢ§åĮĸ
ä»¥ éģ¿åħį
æ°ĳ æĹı
é«ĺ åħ´
ãģ ¦
le arn
æĺ¯åĲ¦ ä¸º
log y
éĢĤåºĶ æĢ§
Ġcom mand
ĠE ng
Ġequ al
åķı é¡Į
cl ude
s ub
å¯¹ æ¯Ķ
Ġin dex
éŁ³ é¢ĳ
å¤± åİ»
æİĪ æĿĥ
b y
b er
ç§į æ¤į
å¹¶ ä½¿çĶ¨
Ġ es
äºĳ è®¡ç®Ĺ
è´· æ¬¾
åĴĮ æĬĢèĥ½
ä»¥ä¸ĭåĩł ç§į
è£ Ĥ
åľ¨ ä¸ŃåĽ½
æļ Ĥ
Ġ __
nå¸ĮæľĽ è¿ĻäºĽ
æĴŃ æĶ¾
ł æª¬
åĪĨ åī²
Ġd own
åĿ ¦
Ġtry ing
æıĲä¾Ľ æĽ´åĬł
ç§¯ åĪĨ
éĵ º
w n
Ġse quence
åĪ ·
å¤ı å¤©çļĦ
() :\
çļĦ ä¸Ģç§į
æĺİ æĺ¾
èİ ĵ
ä¸Ĭ éĿ¢
åıĸå¾Ĺ äºĨ
m s
æĪĳæĥ³ äºĨè§£
ate ly
ä»¥åıĬ å¦Ĥä½ķ
çļĦ å¤§å°ı
N L
éĤĢ è¯·
) \\)
Ġinteg ers
æĦı è§ģ
æı ´
å¼ ¦
åĴĮ å¤ĦçĲĨ
Ñ ı
åĲ ī
ï¼Ł âĢĿ
l u
åľ¨ å®¶
n y
ol s
Ġlearn ing
æŃ£ åĪĻ
Ġdo c
çļĦçŁ Ń
åĮĸ åĲĪçī©
äºĭ æķħ
Ġ4 0
s in
Ġfor mat
ä¸ĵä¸ļ äººå£«
en se
åĪĽ æĸ°çļĦ
åĪĽéĢł åĩº
è¢« è®¤ä¸º
æĹ¥å¸¸ çĶŁæ´»
è¡¨çİ° åĩº
äººå·¥æĻºèĥ½ åı¯ä»¥
è¯ķ åĽ¾
çĪ ¬
è®¡ç®Ĺæľº è§Ĩè§ī
ç¾İä¸½ çļĦ
å° ĩ
åĴĮ è¡Įä¸º
a ut
å¹² æī°
åĽ¾ ä¹¦
ä» ĵ
g in
Ġqu e
Ġc ent
Ġp ower
åĿĲ æłĩ
Ñ Į
a le
Ġ6 0
æĦī å¿«
æĹħ ç¨ĭ
ri d
æ® ĸ
æĻ® éĢļ
Ġp ur
åĨħ ç½®
æĿ¥ æıĲé«ĺ
ç¾ Ĭ
ä¸įä»ħä»ħ æĺ¯
Ġde c
çī©çĲĨ åŃ¦
( [
> `
çļĦæ¦Ĥ çİĩ
åŁ ĥ
vi ew
. "\
è±Ĩ èħĲ
æĪĸ æľįåĬ¡
Ġquest ions
y le
æĿ¥ è§£åĨ³
A pp
æŃ£ å¼ı
ä¼ł æī¿
Ġof f
) .\
ãĢģ `
åŃ¦çĶŁ çļĦåŃ¦ä¹ł
åĢ¾ åĲ¬
ä»İ è¿Ļç¯ĩ
çŃĽ éĢī
èŀį åħ¥
Ġtyp ically
G it
éľĢè¦ģ æł¹æį®
æ¢ °
å®¤ æ°Ķä½ĵ
åĲ ¹
Ġ1 4
ĠT rue
m ath
å®ĥ åľ¨
d own
Ġ2 00
ur l
çĸ ¼
Ġsta nd
æ·»åĬł åĪ°
çļĦç¾İ é£Ł
è¿Ľè¡Į æİĴåºı
Ġ æĸ¹æ³ķ
å¥ ĳ
Ġsi ze
Ġin d
ĠJava Script
æ· ĭ
ens or
çľĭ çľĭ
åĲĪçĲĨ çļĦ
ab ase
Ġpr ice
è£ ģ
åĽĽ ä¸ª
æĿ¡ æ¬¾
7 0
Ġle ss
N ode
Ġf ree
æ» ļ
èĭ ¦
å¹ ½
è¨ Ń
æ®µ èĲ½
Ġt imes
éĤ£ éĩĮ
å®¶åºŃ æĪĲåĳĺ
es sion
æĽ´ é«ĺ
è¿ĩç¨ĭ ä¸ŃçļĦ
ä¸įæĸŃ åľ°
åİĭåĬĽ åĴĮ
éļĲ èĹı
ç ŀ
ĠS o
t itle
åĪĽ ä¸ļ
çļĦ æĸ°
è¡¥ åħħ
å¯ ¦
ĠH T
å¿ĥ æĥħ
é£Ł è°±
ç¡®ä¿Ŀ ä½łçļĦ
è¢« ç§°ä¸º
åı¯ä»¥ å¹«åĬ©
çº½ çº¦
é£ŀ æľº
éĢĻ äºĽ
Ġsignific ant
åĢ¾ åĲĳ
çļĦçľ Ł
âĢĿ ï¼Ī
Ġc ir
Ġtr ue
2 8
ä¹ ±
åįķ åħĥ
é£İ æĻ¯
åĵģ å°Ŀ
le x
Ġad v
} }
åľŁ åľ°
å½ĵ ä»Ĭ
æ´»åĬ¨ çļĦ
å¥ ĭ
æģ ©
æĦıè¯Ĩ åĪ°
ĠD e
an k
ĠT o
å·´ é»İ
l n
Ġm ust
å¾Ī å¤§
htt ps
ç±» çļĦ
çļĦæ³ ¨
Ġd ate
çĶ ¢
åľ° åĽ¾
åİŁ åŃĲ
åĽŀ æĬ¥
Ġst ore
æİ¨èįĲ ä¸ĢäºĽ
å¢ ¨
ä½ł è§īå¾Ĺ
as ks
æĹ¶éĹ´ ç®¡çĲĨ
æľ¬ æĸĩ
Ġ' âĢľ
ä½ł åı¯èĥ½éľĢè¦ģ
m m
é»Ħ èī²
ä¹ĭ å¤Ħ
äºº ä½ĵ
çī¹åĪ« æĺ¯åľ¨
néĢļè¿ĩ ä»¥ä¸Ĭ
åı¯ä»¥ çĶ¨æĿ¥
çªģ çĦ¶
è¡£ æľį
æķ£ æŃ¥
æ³ķ åĽ½
Ðµ Ð
Ù Ħ
ç¯ ®
Ġneed s
Ġd on
æĸĩåĮĸ çļĦ
c ation
æ¸ħ çĲĨ
åıª èĥ½
åĮħ è£ħ
æĻ ¨
å¥½ å¥ĩ
ä¾Ŀèµĸ äºİ
n æĪĳ
çļĦ æĹ¶åĢĻ
bo x
åĪĽæĸ° åĴĮ
Ġw ere
Ġen viron
m odel
Ġ ed
ĠI nt
e mp
åľ¨ çī¹å®ļ
çĲ ´
S C
çļĦ ä»·æł¼
éĻ Ĩ
æŁ łæª¬
åľº æīĢ
è®¡ç®Ĺæľº ç§ĳåŃ¦
çļ ĩ
å¹¿æ³Ľ çļĦ
Ġg roup
Ġb us
Ġwith in
néĢļè¿ĩ è¿ĻäºĽ
è¶³ çĲĥ
çķĻ ä¸ĭ
éĻ ·
è¾£ æ¤Ĵ
é¢ Ī
æķ´ åĲĪ
æĽ´ æ·±åħ¥
Ġw rite
et ime
e lement
ä¼ĺåħĪ çº§
. "},
n ot
åĲĮ ä¸Ģ
Ġan aly
æĪĲ çĨŁ
` ãĢĤ
æµª æ¼«
è¿Ļç§į æĸ¹æ³ķ
çļĦ è¿ĲåĬ¨
æıĲä¾Ľ å¸®åĬ©
å¹´ ä»£
â Ħ
æ¦ Ħ
n P
Ħ æ¦Ħ
åĨ ł
åĽº å®ļ
N N
æĮĩ ä»¤
å¿ĥçĲĨ åŃ¦
é£ ĺ
Ġt arget
Ġo ur
Ġd en
ä¸Ģèĩ´ æĢ§
éķ¿ çļĦ
çĪ ½
pp er
Ġp la
å¹´ æĿ¥
æłĩ è®°
é¢Ħ è®¢
æİ¢ éĻ©
n for
Ġw ell
åĪĽéĢł åĬĽ
äºĨ ä¸ĢäºĽ
ro id
æĹĭ å¾ĭ
çªģ åĩº
è¾ĥ ä¸º
åĴĮ å¹³
Ġ æ£ĢæŁ¥
æĪĸ æĺ¯
åĩº åıĳ
åıĤä¸İ èĢħ
Ġ< =
Ġf ri
å®ŀéĻħ æĥħåĨµ
ĠA dd
æıı ç»ĺ
å·¥ç¨ĭ å¸Ī
æĪĸ ç¼º
éĻĦ è¿ĳ
co me
çİ¯ä¿Ŀ çļĦæĸĩç«ł
} }{
çĶŁ æĹ¥
æĪ ª
Ġint erest
Ġ âĢľ
C SS
çľ¼ çĿĽ
ãĤ Į
t s
et y
Ġfact or
åıĳå±ķ çļĦ
N ame
å¹¶ æ²¡æľī
åĬł çĥŃ
éĢļå¸¸ æĮĩçļĦæĺ¯
Ġmin utes
çĽ Ī
çļĦæ ®
æī¿ æĭħ
C on
se arch
çĬ¯ ç½ª
mo ve
è¿Ļ éĥ¨
åı¯èĥ½ æĽ´
åıĳ æĺİ
Ġrefer ring
æı Ń
æ½ľ åĬĽ
ä¸ĸçķĮ ä¸ĬæľĢ
W rite
åģļ æ³ķ
çļĦæ¼ Ķ
ĠThe y
Ġp d
åħ±åĲĮ åĬªåĬĽ
äº ¡
æ¨¡ æĿ¿
Python ä»£çłģ
ĠS ystem
éģĹ äº§
çĤ¹ çļĦ
Ġw ater
n if
ä¸į åĨį
æĪĳä»¬ ä½¿çĶ¨
F rame
ch ar
Ġin itial
6 4
ä¸Ģ æĿ¡
æİ¥ è¿ĳ
çĸ² åĬ³
re ate
l ate
çļĦæ¯ı ä¸ª
cs v
æ© Ļ
æĳ ĩ
åĬ¨ æľº
è® ĵ
æĻļ ä¸Ĭ
è®° å¾Ĺ
æĥħ å¢ĥ
èĲ¥éĶĢ çŃĸçķ¥
o ve
å® ¿
Ġcol or
åħ¬åħ± äº¤éĢļ
è¿ ª
T rue
sta rt
å°ı çļĦ
æ¯ «
åģ¥åº· çĬ¶åĨµ
le n
Ġn on
è¢« å¹¿æ³Ľ
Ġsol ution
S e
åħħ çĶµ
æķ° ä¸º
nåľ¨è¿Ļä¸ª ä¾ĭåŃĲä¸Ń
nä»¥ä¸Ĭ æĺ¯
æ¬ º
åĪĨ æķ£
çļĦæĳĦ åħ¥
æłĩ å¿Ĺ
å¸®åĬ© ä»ĸä»¬
çĽ®æłĩ åĴĮ
å°½ åĬĽ
è¡Ģ åİĭ
\\ )\
è°ĥ è¯ķ
Ġf in
æ¡ ¥
æĹ ¦
å¤Ħ äºİ
åĴĮ æ°´
è¡Į çļĦ
äººéĻħ åħ³ç³»
æĿ Ģ
çĮ« åĴª
èŃ °
ç§¯ ç´¯
è§Ĥ çľĭ
Ġo pen
ä¸ľ è¥¿
èĢĮ è¨Ģ
è¯ Ī
æī© å¤§
çļĦ é«ĺ
ä¿ĥè¿Ľ äºĨ
è´ «
çº ·
è¯· æ³¨æĦı
èĥ¡ æ¤Ĵ
åħį è´¹
éģ¿åħį ä½¿çĶ¨
Ġeff ect
èī¾ ç±³
çĲĨ æĥ³
åĽŀ å¿Ĩ
t x
åĸ »
åĩ½æķ° çļĦ
å®ĥ å°Ĩ
æŀĦå»º ä¸Ģä¸ª
Ġ2 4
éģ¿åħį è¿ĩåº¦
it ions
è¯·éĹ® æĤ¨
æ´ Ľ
æĪ ¶
P y
) :
æĹ¥ çĽĬ
Ġsi mp
W indows
ç³ Ĭ
åĪĽéĢł ä¸Ģä¸ª
æĻ® åıĬ
æĺ¯ æľĢ
âĦ ĥ
E LECT
è®¾å¤ĩ çļĦ
Ġs ur
çĨŁ æĤī
çĩ ¥
åľ Ī
åıĺ æĪĲ
éĿ© åĳ½
æĢ§ æł¼
ER E
l ing
å¥³ åŃ©
å¾Ī å¥½çļĦ
Ġcomm un
èĩª å®ļä¹ī
å¦ Ī
åĬ³ åĬ¨
æľĢå¤§ åĢ¼
æĮ ĸ
æĭ Ĥ
Ġbe fore
è¿Ļåı¯èĥ½ åĮħæĭ¬
åĳ½ åĲį
ri s
ç§ĳæĻ® æĸĩç«ł
ä¸ªäºº ä¿¡æģ¯
ãĢ Ĳ
åĨĻ ä¸Ģä¸ª
æ© Ħæ¦Ħ
çĶŁæ´» è´¨éĩı
nè¿Ļ æ®µ
çļĦç Ļ
çĽ¸åĲĮ çļĦ
åĵĪ å¸Į
è¿Ļ ä½¿å¾Ĺ
mb er
ä½ł ä¼ļ
ers e
æĶ¯æĮģ åĴĮ
éģ ©
çİ¯ èĬĤ
äºĮ æ°§åĮĸ
ãĢ ĳ
å¤©æ°Ķ é¢ĦæĬ¥
çļĦæ° ĽåĽ´
Ġal gorithm
å¿ĥ èĦı
éĶĢåĶ® é¢Ŀ
åĪĨå¸ĥ å¼ı
åĬĽ åŃ¦
HT TP
åĽ¾ è¡¨
çļĦ æĸĩæľ¬
ãĢĤâĢĿ \
Ġrespon se
éĢ Ĩ
\' )\
ä¸Ń æıĲåıĸ
ĠF alse
çļĦ ä¸į
çĥŃ éĩı
y pe
Ġe st
åį° åº¦
d f
èĥ ¸
Ġli br
n ä¾ĭå¦Ĥ
æ» ´
Ġde pend
å±ķçİ° äºĨ
çļĦ åŁİå¸Ĥ
éĢļè¿ĩ åĪĨæŀĲ
çļĦ æľªæĿ¥
æľī æĹ¶åĢĻ
ç§ĭ å¤©
Ġstep s
Ġsu pport
çģ °
æĺİ å¤©
co mp
å·¥ä½ľ æķĪçİĩ
æĺ¯ä¸Ģ ä½į
å®ļæľŁ è¿Ľè¡Į
st it
J SON
ä¸Ģ å®¶
éģ ¸
éħ ª
g es
å¤ ¹
Ar ray
æĺ¯ åŁºäºİ
éĻ¤ ä»¥
çļĦç¾İ å¥½
åĮ» éĻ¢
æ¶ Ĥ
Ġar g
éĩİçĶŁ åĬ¨çī©
éĢ ĥ
å¯Ĩ åº¦
0 1
Ġha pp
ãģ ĵ
atter n
ç»ĺ çĶ»
er o
æĿ¥ çľĭ
åł µ
å£ ģ
åħ Ķ
å¦Ĥ æŃ¤
æĤ ¬
å¯¹ ç¤¾ä¼ļ
æł Ī
Ġh ad
Ġhe alth
ord er
å¾ Ĵ
ir d
æĪĸ ä½¿çĶ¨
çĽ Ĵ
åĻ¨ çļĦ
ä¸įåı¯ æĪĸç¼º
Ġse e
æł· æľ¬
ä¸į å¿ħè¦ģçļĦ
c u
Ġsome thing
çļĦæĽ ´
åĴĮ æĸ¹æ³ķ
ri es
ä¿ĿæĮģ åģ¥åº·
èĬ Ŀ
åģ ¿
æĢ§åĴĮ åı¯
åı¯ä»¥ å¢ŀåĬł
çļĦ é¢ľèī²
" ï¼Į
æ´ĭ èĳ±
Ġa p
è®º åĿĽ
Ġmat rix
çİ Ľ
èĲ Ŀ
æĽ´ æľī
å°± åı¯ä»¥
Ġch o
Ġpartic ular
3 2
çĽ Ł
ro me
ä¹Ł åľ¨
æĭĽ èģĺ
Ġpl an
åĮºåĿĹéĵ¾ æĬĢæľ¯
çļĦ åŃ£èĬĤ
åĽ¢éĺŁ çļĦ
åı ł
Ġpro f
} ")\
åĬł ä¸Ĭ
at ures
ä¸ ĥ
åģľ æŃ¢
Ġdeterm ine
è§£åĨ³ éĹ®é¢ĺçļĦ
å¸® æĪĳæĥ³
å§ĵ åĲį
äºĨ è®¸å¤ļ
Ġw rit
èĪ ĩ
éĶħ ä¸Ń
A C
çīĽ èĤī
æĪĳ æĹłæ³ķ
è® ¯
Ġlo op
our ces
å¦ĤæŀľæĤ¨ éľĢè¦ģ
l lo
ä¸Ģ éģĵ
åĲĦ èĩª
ç¼º å¤±
s on
æĹ© æľŁ
umb er
mple ment
if ied
ç»Ł ä¸Ģ
æľĢ ä½İ
æ¼Ķ è®²
c cess
o king
å µ
å¯¹ æĤ¨
æĽ´ æį¢
åºĶçĶ¨ çļĦ
èº«ä½ĵ åĴĮ
åįĬ å¾Ħ
å¸®åĬ© åĮ»çĶŁ
èĭ± åĽ½
è¿ĺæľī åħ¶ä»ĸ
Ġmultip le
çº¿ ä¸Ĭ
Ġp ol
AT E
æĪĸèĢħ åľ¨
æĤ£èĢħ çļĦ
çļĦæŁ Ĳ
Ġ\\ [
å¿ĥçĲĨ åĴ¨è¯¢
æľĢ å¤§çļĦ
ç´ł é£Ł
j ava
äºĭ ä¸ļ
ab a
è¯ĨåĪ« åĴĮ
ç¯ĩ åħ³äºİ
ĠA n
ut put
åĭ Ļ
Ġm ark
å®ĥ åı¯ä»¥
Ġs ing
ä¸įæĸŃ è¿ĽæŃ¥
éĢļå¸¸ æĺ¯
ä¸» äºº
sit e
çļĦ äºĭæĥħ
çĩĥ æĸĻ
3 6
ĠÐ ²
çĮ ľ
n å¯¹äºİ
çļĦ åĬĽéĩı
å¤ªéĺ³ ç³»
å¼ķ åĬĽ
å¹¶ è¡Į
nd er
çļĦ åīį
çĶŁæĪĲ ä¸Ģæ®µ
åŃĹ ä½ĵ
Ġus es
åħ´è¶£ åĴĮ
äºº æīį
æĻ® éģį
èĨ ľ
nF or
å®¢æĪ· ç«¯
æīĢéľĢ çļĦ
Ġat t
ª æĺİ
çİ¯å¢ĥ åĴĮ
ç£ ¨
L L
tx t
çĶ¨æĪ· åıįé¦Ī
H ERE
c ase
A N
æķĪ çĽĬ
U RL
è·¯ çĶ±
ä¸īè§Ĵ å½¢
æĬ µ
éĿŀ æ³ķ
Ġimp ro
è¾¹ ç¼ĺ
Ġstate ment
c m
åľ¨ è¿Ľè¡Į
æŀ Ŀ
éĿŀå¸¸ éĢĤåĲĪ
ä¸ ¢
çļĦ è¯Ńè¨Ģ
ä½į æķ°
è¯į è¯Ń
å¹¶ å°Ĩåħ¶
Ġmo d
ä¹Ĳ æĦı
ä»ĭç»į ä¸Ģä¸ĭ
åĪ¶ åĵģ
è¿½ è¸ª
è¿Ŀ åıį
åľ¨ éĿ¢å¯¹
çļĦ çĲĨè§£
çĽ¸äºĴ ä½ľçĶ¨
ç©¿ çĿĢ
çµ ±
æĮ Ĥ
é¡¾ éĹ®
æĬ« èĲ¨
ä½ł æľīä»Ģä¹Ī
éĽ ķ
å¼Ģ æºĲ
Ã Ń
çģ Ń
o ot
éĤ »
åľĨ çļĦ
æĥ §
æĤ¨ æıĲä¾Ľ
åĪ© çİĩ
èĬ Ĵ
çĽ¸ æ¯Ķ
éĿŀå¸¸ æĦŁè°¢
å¹¿ éĺĶ
åľ¨ å®ŀéĻħåºĶçĶ¨ä¸Ń
æµģ çķħ
äººå·¥æĻºèĥ½æĬĢæľ¯ çļĦ
NL P
æŃ£ éĿ¢
åı¯ä»¥ æľīæķĪ
ä¸ŃåĽ½ çļĦ
æĿ¥ å¤ĦçĲĨ
éŁ §
çļĦ æķĪæŀľ
çŃī å¤ļç§į
æ¸© å®¤æ°Ķä½ĵ
æĴ ĳ
å»¶ è¿Ł
Ġt asks
æĦŁ çŁ¥
Ġ éĢīæĭ©
Ġpro ject
Ġcon sole
æĬ½ è±¡
Ġlar ge
Ġbe st
num s
å½±åĵį åĬĽ
é¡º åĪ©
éľ ľ
D B
Ġprogram ming
åı¯ä»¥ å®ŀçİ°
ä»ĸ äººçļĦ
è¿ĳ å¹´æĿ¥
åµ Į
ä»£çłģ ä¸Ń
Ġo c
? "},
Ġd id
èµĦæºĲ åĴĮ
Python çļĦ
æĻ ´
éŃħ åĬĽ
ä¹ Ļ
æĽ´ é«ĺçļĦ
é¡ ŀ
Ġch ange
çīĪ æĿĥ
ĠS e
å§¿ åĬ¿
èĲ¥ éĢł
èµ ¢
æĺŁ æľŁ
ĠB e
åĽłä¸º å®ĥä»¬
ile s
ç«ŀäºī å¯¹æīĭ
å¿ĥ ä¸Ń
åĨ· éĿĻ
å¼Ģ å¤´
è¢« è§Ĩä¸º
å°ı äºİ
çŁŃ æľŁ
S p
ä¸Ĭ åįĩ
è´Ł è½½
u ally
çĽ¸ çŃī
ra nd
ä¼ļ å¯¹
n ect
éĢŁ åº¦åĴĮ
Ġma king
åİ Ĥ
Ġ åĪĽå»º
çļĦ åľºæĻ¯
pect ed
in ing
çļĦç¼ĸç¨ĭ è¯Ńè¨Ģ
åį §
, "
æİ¥ ç§į
è¿Ľ åº¦
åı¯èĥ½ å½±åĵį
åıĤ è§Ĥ
Ġs ort
é¢ ¨
ĠA l
n class
åħ¶ ä¸ŃçļĦ
Ġsu g
çļĦç ķ
u ra
æī ¬
Ġ !
a ir
Ġenviron ment
èĩªçĦ¶ çģ¾å®³
å² ¸
åĪĨ æĶ¯
åĿļ æŀľ
å² Ĺ
å®¶ éķ¿
Ġb ook
ile d
Ġcon cept
çļĦæŃ£ ç¡®
éĢ Ĭ
å¹¶ æł¹æį®
å¤ĸ è§Ĥ
æĴ Ĵ
åľ°åĮº çļĦ
le ction
Ġc ertain
æ® ĭ
æ¶Ī éĻ¤
åĲĪ æĪĲ
ä½łåı¯ä»¥ éĢļè¿ĩ
éĢļå¸¸ çĶ¨äºİ
ä»Ķ ç»Ĩ
( -
äºĮæ°§åĮĸ ç¢³
æ¯ı ä¸Ģä¸ª
æ¯ı åĳ¨
si b
è¿ «
å®ŀ çĶ¨
Ġdi stance
å°ı åŀĭ
` ãĢģ`
æ¸¸ å®¢
èĬĤ çľģ
éĢĤ çĶ¨
Ġcom bin
çĸ¼ çĹĽ
np lt
ä¸º äººç±»
ä¸Ģ æĹ¦
äºĭ åĬ¡
å¢ŀ æ·»
çļĦ ä¸ĸçķĮ
æį ī
çļĦæ į
ge ther
è®¤ åı¯
èģ ªæĺİ
åľ°çĲĥ çļĦ
éĿ¢ä¸´ çĿĢ
' ll
åĴĮ ç»ıéªĮ
é¥®é£Ł ä¹łæĥ¯
ĠS h
åĨĽ äºĭ
æĽ´ å¤įæĿĤçļĦ
è´Ł æĭħ
çİ°ä»£ ç¤¾ä¼ļ
ä¹ĭ æĹħ
å°ı ç»Ħ
Ġpot ential
nè¿Ļæ®µ ä»£çłģ
å®ĥ ä¸įä»ħ
ç¬¬ä¸ī æĸ¹
æľºåĻ¨ ç¿»è¯ĳ
w h
åĩł ä½ķ
oo ks
çĶ¨æĪ· è¾ĵåħ¥
Ġ- --
çĥŃ æĥħ
æ¯ı ç§į
in clude
å©ļ ç¤¼
ãĢĤ `
èĤ ¿
å»ºç«ĭ ä¸Ģä¸ª
Ġsh ow
si de
è° ¨
åķ Ĭ
èĥ½ å¸®åĬ©ä½ł
Ġwe ek
èĪª ç©º
é½ Ĳ
çļĦæ¢ ¦
Ġ** ãĢĬ
åģļ å¥½
æıĲä¾ĽæĽ´ å¥½çļĦ
åĴĮ é«ĺ
Ġpro b
çħ İ
Ġrel ated
ä»» æĦı
åĴĮ ç»ıæµİ
iv ity
æľī æĹ¶
æµģ åĬ¨
çļĦçĹ ħ
D e
ä¸¾ åĬŀ
ä¸Ģæ¬¡ æĢ§
çļĦæĦŁ è§ī
C ont
ç»ĻæĪĳ ä¸ĢäºĽ
li g
éļ¾ åº¦
åı£ è¯Ń
lo b
éĸ ĭ
å¿ĥ åĴĮ
lib aba
åĴĮ ä¸Ģä¸ª
æĸĩ çĮ®
çļĦæĬĢ å·§
æĻ Ĵ
äººå·¥æĻºèĥ½ åľ¨åĮ»çĸĹé¢ĨåŁŁ
æĸĩä»¶ ä¸Ń
æĲľç´¢ å¼ķæĵİ
ç»ı çĲĨ
res pon
æĬ¥ éģĵ
å®¡ è®¡
èĬ± åĽŃ
o ther
åı¯èĥ½ ä¸į
å¯¿ åĳ½
ou ble
æıĲ éĹ®
åĴĮ æķĻèĤ²
l st
n x
d at
éĿŀå¸¸ å¥½
div id
èĥ ĥ
å¯¹è¯Ŀ åĨħå®¹
å¹´ äºº
çļĦæĻ® åıĬ
å¹² çĩ¥
çļĦæ »
äººå·¥æĻºèĥ½ å°Ĩ
æķ°æį® ç»ĵæŀĦ
æĿĲ è´¨
ç§ĺ å¯Ĩ
è¯· å¸®æĪĳ
çļĦæ¸© åº¦
çļĦæ Ĳ
é¸ Ń
ang es
æĤ¨ å¥½
é¦ ¨
Ġw ide
ro ss
çĮ ª
çħ§ çīĩ
[ '
æĻ¯ è§Ĥ
çļĦ åħī
éĿ¢ åĲĳ
çļĦ åĩ½æķ°
m od
Ġt re
åħ¶ åľ¨
c ing
ĠM y
sp lit
Ġso ft
ä¸Ģ éĥ¨
Ġbet ter
ä¾Ŀ æį®
è¡¡ éĩı
å¤§ å¤§
çĹħ äºº
[ \'
åŃĺåľ¨ ä¸ĢäºĽ
Ġin divid
G P
åĬł å·¥
éĥ½æľī åħ¶
åŁºç¡Ģ è®¾æĸ½
ä¸Ń éĹ´
du ce
çļĦæ® µ
æľī æľº
Ġn ext
ä»¥ä¸ĭåĩł çĤ¹
å»º èŃ°
l ue
éģ ¥
æĭŁ åĲĪ
åĲ¬ è¯´
at us
Ġgo od
ĠThe se
æ¬ ²
ä¸į çŁ¥éģĵ
çĶŁ åĬ¨
Ġe ng
å¢ŀåĬł äºĨ
Ġ æµĭè¯ķ
åĬł åī§
æ©Ħæ¦Ħ æ²¹
Ġs ci
A nd
æľī å®³
å®ļ å¾ĭ
Ġeff ic
ç¬¬äºĮ ä¸ª
st d
æī®æ¼Ķ çĿĢ
æº ¶
äº ¿
äº¤ åıī
æ¯ıä¸ªäºº çļĦ
nd ing
Ġli ght
Ġ ê
åĴĮ éģĵå¾·
éľĢè¦ģ è¿Ľè¡Į
çļĦ å¸Ĥåľº
